Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
/*******************************************************************************
* File Name        : lcd_task.c
*
* Description      : This file implements the LCD display modules for Face ID
*                    demo.
*
* Related Document : See README.md
*
********************************************************************************
* (c) 2025-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/

/*******************************************************************************
* Header Files
*******************************************************************************/
#include "cybsp.h"
#include "lcd_task.h"
#include "FreeRTOS.h"
#include "task.h"
#include "FreeRTOSConfig.h"
#include "cy_graphics.h"
#include "ifx_face_id.h"
#include "lcd_graphics.h"
#include "ifx_image_utils.h"
#include "ifx_time_utils.h"
#include "usb_camera_task.h"
#include "lcd_task.h"
#include "vg_lite.h"
#include "start_face_enrolment_btn_img.h"
#include "save_face_enrolment_btn_img.h"
#include "cancel_released_btn_img.h"
#include "cancel_pressed_btn_img.h"
#include "clear_released_btn_img.h"
#include "clear_pressed_btn_img.h"
#include "no_camera_img.h"
#include "camera_not_supported_img.h"
#include <inttypes.h>

#ifdef ENABLE_WEB_STREAMING
#include "chunked_stream.h"
/* Include UART protocol for Face ID status codes */
#include "uart_protocol.h"
#endif

#ifdef USE_BIGGER_FONT
#include "ifx_gui_render.h"
#include "oob_uart_cmd.h"

#endif /* USE_BIGGER_FONT */

#ifdef ENABLE_WEB_STREAMING
/*******************************************************************************
* External Function Declaration for UART Streaming
*******************************************************************************/
extern void stream_push_frame(const uint16_t *rgb565);
extern void stream_push_frame_with_faceid(const uint16_t *rgb565, uint8_t faceid_status);
extern bool stream_send_faceid_metadata(const uart_faceid_metadata_t *metadata);
extern bool is_streaming_active(void);  /* Check if UART streaming is active */
#endif
/*******************************************************************************
* Macros
*******************************************************************************/
#define I2C_DELAY_MS      (200)

#ifdef TEST_SAVED_IMAGE
#include "one_detection.h"   /* Contains static uint8_t test_image_array[size] */
#define ONE_DETECTION_WIDTH  NUM_ONE_DETECTION_WIDTH    /* Your test image width */
#define ONE_DETECTION_HEIGHT NUM_ONE_DETECTION_HEIGHT   /* Your test image height */
#define ONE_DETECTION_SIZE   (ONE_DETECTION_WIDTH * ONE_DETECTION_HEIGHT * NUM_ONE_DETECTION_SIZE_MULTIPLIER)
#endif

#define HOME_BTN_X_POS                 (DISPLAY_W \
                                            - HOME_BUTTON_IMG_WIDTH - HOME_BTN_OFFSET)
#define HOME_BTN_Y_POS                 (LCD_TEXT_TOP_MARGIN)
#define FACE_ENROL_BTN_X_POS           (FACE_ENROL_BTN_OFFSET)
#define FACE_ENROL_BTN_Y_POS           ((DISPLAY_H / NUM_DISPLAY_DIVISOR_3) + FACE_ENROL_BTN_Y_OFFSET)
#define CANCEL_BTN_X_POS               (FACE_ENROL_BTN_OFFSET)
#define CANCEL_BTN_Y_POS               (FACE_ENROL_BTN_Y_POS + CANCEL_BTN_Y_OFFSET + FACE_ENROL_BTN_Y_OFFSET)
#define CLEAR_BTN_X_POS                (FACE_ENROL_BTN_OFFSET)
#define CLEAR_BTN_Y_POS                (CANCEL_BTN_Y_POS + CLEAR_BTN_Y_OFFSET + FACE_ENROL_BTN_Y_OFFSET)
#define NO_CAMERA_IMG_X_POS            ((DISPLAY_W / 2U) \
                                            - ((NO_CAMERA_IMG_WIDTH / 2U) + NO_CAMERA_IMG_OFFSET))
#define NO_CAMERA_IMG_Y_POS            ((DISPLAY_H / 2U) \
                                            - (NO_CAMERA_IMG_HEIGHT / 2U))
#define CAMERA_NOT_SUPPORTED_IMG_X_POS ((DISPLAY_W / 2U) \
                                            - ((CAMERA_NOT_SUPPORTED_IMG_WIDTH / 2U) + CAMERA_NOT_SUPPORTED_IMG_OFFSET))
#define CAMERA_NOT_SUPPORTED_IMG_Y_POS ((DISPLAY_H / 2U) \
                                            - (CAMERA_NOT_SUPPORTED_IMG_HEIGHT / 2U))
#define FPS_TXT_Y_POS                  (DISPLAY_H - FPS_TXT_Y_OFFSET)
#define PLOT_ALIGNED_X                  (NUM_PLOT_ALIGNED_X)
#define PLOT_ALIGNED_Y                  (NUM_PLOT_ALIGNED_Y)

#ifdef USE_KIT_PSE84_HMI
#define ROTATE_ANGLE                    (90.0f)
#define ROTATE_MATRIX_X                 (240)
#define ROTATE_MATRIX_Y                 (240)
#define FLIP_MATRIX_X                   (1.0f)
#define FLIP_MATRIX_Y                   (1.0f)
#define HMI_BBOX_ROTATION_OFFSET_X      (70)
#endif

