Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
/*******************************************************************************
* Global Variables
*******************************************************************************/
vg_lite_buffer_t    *renderTarget; /* used by lcd_bsp.c */
vg_lite_buffer_t    usb_yuv_frames[NUM_IMAGE_BUFFERS]; /* used by usb_camera_task.c */

/* UART command flags set by oob_uart_cmd.c (non-HMI) or touch buttons (all targets) */
bool fid_home_start_enrollment_flag = false;
bool fid_home_cancel_enrollment_flag = false;
bool fid_home_clear_enrolled_users_flag = false;
#ifdef ENABLE_WEB_STREAMING
bool fid_home_complete_enrollment_flag = false;
#endif

cy_stc_scb_i2c_context_t disp_i2c_controller_context;
vg_lite_buffer_t home_button_buffer;
vg_lite_matrix_t home_button_matrix;

static vg_lite_matrix_t    matrix;
static cy_stc_gfx_context_t gfx_context;
static vg_lite_buffer_t    bgr565;
static vg_lite_buffer_t    display_buffer[NUM_DOUBLE_BUFFERS];      /* double display frame buffers */

static GFXSS_Type    *base = (GFXSS_Type*) GFXSS;

static enrollment_state_t enrollment_state = ENROLLMENT_STATE_NONE;
static enrollment_type_t enrollment_type = ENROLLMENT_TYPE_NONE;

/* Heap memory for VGLite to allocate memory for buffers, command, and tessellation buffers */
CY_SECTION(".cy_xip") __attribute__((aligned(128), used))
        uint8_t contiguous_mem[VGLITE_HEAP_SIZE] = {HEX_MEMORY_FILL_VALUE};
volatile void *vglite_heap_base = &contiguous_mem;

CY_SECTION(".cy_socmem_data")
__attribute__((aligned(64)))
static uint8_t Image_buf_bgr565[CAMERA_BUFFER_SIZE] = {RESET_VALUE_INDEX};

CY_SECTION(".cy_socmem_data")
__attribute__((aligned(64)))
static uint8_t  Image_buf_bgr888[(IMAGE_HEIGHT) * (IMAGE_WIDTH) * RGB888_BYTES_PER_PIXEL] = {RESET_VALUE_INDEX};

#ifdef USE_KIT_PSE84_HMI
/* Rotated BGR565 buffer: 90 CW rotation swaps dimensions to CAMERA_HEIGHT x CAMERA_WIDTH */
CY_SECTION(".cy_socmem_data")
__attribute__((aligned(64)))
static uint8_t Image_buf_bgr565_rotated[CAMERA_BUFFER_SIZE] = {RESET_VALUE_INDEX};
#endif /* USE_KIT_PSE84_HMI */

/* scale factor from the camera image to the display */
static float    scale_Cam2Disp;
static int      display_offset_x = RESET_VALUE_INDEX;
static int      display_offset_y = RESET_VALUE_INDEX;

/* 8 colors: red, green, blue, yellow, cyan, purple, white, black */
static uint8_t    color_r[COLOR_ARRAY_SIZE] = {COLOR_RED,   COLOR_BLACK, COLOR_BLACK, COLOR_RED,   COLOR_BLACK, COLOR_RED,   COLOR_RED,   COLOR_BLACK};
static uint8_t    color_g[COLOR_ARRAY_SIZE] = {COLOR_BLACK, COLOR_GREEN, COLOR_BLACK, COLOR_GREEN, COLOR_GREEN, COLOR_BLACK, COLOR_GREEN, COLOR_BLACK};
static uint8_t    color_b[COLOR_ARRAY_SIZE] = {COLOR_BLACK, COLOR_BLACK, COLOR_BLUE,  COLOR_BLACK, COLOR_BLUE,  COLOR_BLUE,  COLOR_BLUE,  COLOR_BLACK};

#ifdef SHOW_INFERENCING_TIME
static float    model_inferencing_time = RESET_VALUE_INDEX;
#else
static float    fps = RESET_VALUE_INDEX;
#endif /* SHOW_INFERENCING_TIME */

static float    Time_getInputImage;
static float    Prep_Wait_Buf = RESET_VALUE_INDEX;
static float    Prep_YUV422_to_bgr565 = RESET_VALUE_INDEX;
static float    Prep_bgr565_to_Disp = RESET_VALUE_INDEX;
static float    Prep_RGB565_to_RGB888 = RESET_VALUE_INDEX;

/* USB race condition recovery mode watchdog variables */
static float last_successful_frame_time = RESET_VALUE_INDEX;
static float watchdog_timeout = NUM_WATCHDOG_TIMEOUT_MS; /* milliseconds */
static int recovery_attempts = RESET_VALUE_INDEX;

/* Static Variables for Database Status (Merged System) */
static uint8_t current_user_count = RESET_VALUE_INDEX;
static bool database_full_overlay_flag = RESET_VALUE_INDEX;
static float database_full_overlay_timestamp = RESET_VALUE_INDEX;
/* Show overlay for 5 seconds */
static const float DATABASE_FULL_OVERLAY_DURATION_MS_CONST = DATABASE_FULL_OVERLAY_DURATION_MS;

#ifdef PLOT_ALIGNED_FACES
static aligned_faces_t aligned_faces;
#endif /* PLOT_ALIGNED_FACES*/

static ifx_faceid_embeddings_t faceid_embeddings;

volatile bool button_debouncing = false;
volatile uint32_t button_debounce_timestamp = RESET_VALUE_INDEX;

/* place in non-volatile flash memory */
CY_SECTION(".cy_nvm_user_data") __attribute__((used))ifx_faceid_embeddings_t enrolled_user_faceid_embeddings;

/* DC IRQ Config */
const cy_stc_sysint_t dc_irq_cfg =
{
        .intrSrc = GFXSS_DC_IRQ,
        .intrPriority = DC_INT_PRIORITY
};

/* GPU IRQ Config */
const cy_stc_sysint_t gpu_irq_cfg =
{
        .intrSrc = GFXSS_GPU_IRQ,
        .intrPriority = GPU_INT_PRIORITY
};


const cy_stc_sysint_t i2c_controller_irq_cfg =
{
        .intrSrc      = DISPLAY_I2C_CONTROLLER_IRQ,
        .intrPriority = I2C_CONTROLLER_IRQ_PRIORITY,
};

#if defined(USE_KIT_PSE84_HMI)
mtb_display_st7701s_backlight_config_t st7701s_backlight_cfg =
{
    .bl_port    = CYBSP_DISP_BACKLIGHT_PWM_PORT,
    .bl_pin     = CYBSP_DISP_BACKLIGHT_PWM_PIN,
    .pwm_hw     = CYBSP_PWM_DISP_BACKLIGHT_HW,
    .pwm_num    = CYBSP_PWM_DISP_BACKLIGHT_NUM,
    .pwm_config = &CYBSP_PWM_DISP_BACKLIGHT_config
};

mtb_ctp_ft5446_config_t ctp_ft5446_config =
{
    .scb_instance     = CYBSP_I2C_DISPLAY_CONTROLLER_HW,
    .i2c_context      = &disp_i2c_controller_context,
    .rst_port         = CYBSP_DISP_TP_RST_PORT,
    .rst_pin          = CYBSP_DISP_TP_RST_PIN,
    .irq_port         = CYBSP_DISP_TP_INT_PORT,
    .irq_pin          = CYBSP_DISP_TP_INT_PIN,
    .irq_num          = CYBSP_DISP_TP_INT_IRQ,
    .touch_event      = false
};
#else
mtb_ctp_ft5406_config_t ft5406_config =
{
        .i2c_base    = DISPLAY_I2C_CONTROLLER_HW,
        .i2c_context = &disp_i2c_controller_context
};
#endif

touch_button_event_t touch_button_event[BUTTON_ID_MAX];

/*******************************************************************************
* Functions
*******************************************************************************/

/*******************************************************************************
* Function Name: mirrorImage
********************************************************************************
* Summary:
*  Mirrors an image horizontally by swapping pixels across the width of the image
*  buffer, assuming a fixed bytes-per-pixel format.
*
* Parameters:
*  vg_lite_buffer_t *buffer: Pointer to the image buffer to be mirrored
*
* Return:
*  void
*
*******************************************************************************/
static void mirrorImage(vg_lite_buffer_t *buffer)
{
    uint8_t temp[NUM_TEMP_ARRAY_SIZE];
    uint8_t *start, *end;
    int m, n;
    int bytes_per_pixel  = RESET_VALUE_INDEX ;

    bytes_per_pixel = BYTES_PER_PIXEL;

