Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
    for (m = NUM_LOOP_START; m < CAMERA_HEIGHT ; m++)
    {

        start = buffer->memory + m * (CAMERA_WIDTH * bytes_per_pixel);

        end = start + (CAMERA_WIDTH - NUM_LOOP_INCREMENT_1) * bytes_per_pixel;


        for (n = NUM_LOOP_START; n < CAMERA_WIDTH / NUM_DISPLAY_OFFSET_2; n++)
        {

            for (int i = NUM_LOOP_START; i < bytes_per_pixel; i++)
            {
                temp[i] = start[i];
            }

            for (int i = NUM_LOOP_START; i < bytes_per_pixel; i++)
            {
                start[i] = end[i];
            }

            for (int i = NUM_LOOP_START; i < bytes_per_pixel; i++)
            {
                end[i] = temp[i];
            }

            start += bytes_per_pixel;
            end -= bytes_per_pixel;
        }
    }
}

#ifdef USE_KIT_PSE84_HMI
/********************************************************************************
* Function Name: rotate_frame
*********************************************************************************
* Summary:
*  Rotates a BGR565 frame/image 90 degrees clockwise and writes the result to a
*  destination buffer. The source dimensions are CAMERA_WIDTH x CAMERA_HEIGHT
*  and the destination has swapped dimensions CAMERA_HEIGHT x CAMERA_WIDTH.
*
* Parameters:
*  const uint8_t *src: Pointer to the source BGR565 image buffer
*  uint8_t *dst:       Pointer to the destination BGR565 image buffer
*
* Return:
*  void
*
********************************************************************************/
static void rotate_frame(const uint8_t *src, uint8_t *dst)
{
    const uint16_t *src16 = (const uint16_t *)src;
    uint16_t *dst16 = (uint16_t *)dst;

    /* 90 CW: dst[new_y][new_x] = src[CAMERA_HEIGHT-1-new_x][new_y]
    * Output width = CAMERA_HEIGHT, output height = CAMERA_WIDTH */
    for (int new_y = 0; new_y < CAMERA_WIDTH; new_y++) {
        for (int new_x = 0; new_x < CAMERA_HEIGHT; new_x++) {
            int src_x = new_y;
            int src_y = CAMERA_HEIGHT - 1 - new_x;
            dst16[new_y * CAMERA_HEIGHT + new_x] = src16[src_y * CAMERA_WIDTH + src_x];
        }
    }
}
#endif /* USE_KIT_PSE84_HMI */


/*******************************************************************************
* Function Name: update_database_user_count
********************************************************************************
* Summary:
*  Update the current user count from the database.
*
* Parameters:
*  void
*
* Return:
*  ifx_faceid_rslt_t Status of the operation
*
*******************************************************************************/
static ifx_faceid_rslt_t update_database_user_count(void)
{
    ifx_faceid_rslt_t result = ifx_face_id_get_enrolled_user_count(&faceid_embeddings, &current_user_count);
    if (result != IFX_FACEID_RSLT_SUCCESS)
    {
        printf("[LCD_TASK][ERROR] Failed to get user count: %d\n", result);
        current_user_count = RESET_VALUE_INDEX; /* Default to 0 if we can't check */
    }
    return result;
}


/********************************************************************************
* Function Name: is_database_full
*********************************************************************************
* Summary:
*  Check if database is currently at capacity.
*
* Parameters:
*  void
*
* Return:
*  bool
*
********************************************************************************/
static bool is_database_full(void)
{
    return (current_user_count >= MAX_N_USER);
}


/********************************************************************************
* Function Name: trigger_database_full_overlay
*********************************************************************************
* Summary:
*  Trigger the temporary overlay warning message
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
static void trigger_database_full_overlay(void)
{
    database_full_overlay_flag = true;
    database_full_overlay_timestamp = ifx_time_get_ms_f();
    printf("[LCD_TASK] Database full overlay triggered - will display warning\n");
}


/********************************************************************************
* Function Name: should_show_database_full_overlay
*********************************************************************************
* Summary:
*  Check if database full overlay should still be displayed
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
static bool should_show_database_full_overlay(void)
{
    if (!database_full_overlay_flag) {
        return false;
    }

    float current_time = ifx_time_get_ms_f();
    float elapsed = current_time - database_full_overlay_timestamp;

    if (elapsed >= DATABASE_FULL_OVERLAY_DURATION_MS_CONST)
    {
        database_full_overlay_flag = false; /* Clear flag after timeout */
        return false;
    }

    return true;
}


/********************************************************************************
* Function Name: display_database_status
*********************************************************************************
* Summary:
*  Display database status in top-left area (always visible)
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
static void display_database_status(void)
{
    /* Always show current user count */
    ifx_lcd_set_FGcolor(COLOR_WHITE, COLOR_WHITE, COLOR_WHITE); /* White text */
    ifx_lcd_set_BGcolor(COLOR_BLACK, COLOR_BLACK, COLOR_BLACK);       /* Black background */
    ifx_lcd_printf(((DISPLAY_W - NUM_DISPLAY_OFFSET_11) / NUM_DISPLAY_OFFSET_2 - NUM_DISPLAY_OFFSET_120), LCD_TEXT_TOP_MARGIN, "USERS: %d/%d", current_user_count, MAX_N_USER);

    /* Show capacity warning if close to full or full */
    if (is_database_full())
    {
        ifx_lcd_set_FGcolor(COLOR_RED, COLOR_BLACK, COLOR_BLACK);     /* Red text */
        ifx_lcd_set_BGcolor(COLOR_BLACK, COLOR_BLACK, COLOR_BLACK);       /* Black background */
        ifx_lcd_printf(((DISPLAY_W - NUM_DISPLAY_OFFSET_15) / NUM_DISPLAY_OFFSET_2), LCD_TEXT_TOP_MARGIN, "DATABASE FULL!");


        if (TOUCH_BUTTON_EVENT_PRESSED == touch_button_event[FACE_ENROL_BUTTON_ID].event)
        {
            touch_button_event[FACE_ENROL_BUTTON_ID].event = TOUCH_BUTTON_EVENT_RELEASED;
            touch_button_event[FACE_ENROL_BUTTON_ID].pressed = false;
        }

