Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
    }
    else if (current_user_count >= MAX_N_USER - NUM_LOOP_INCREMENT_1)
    {
        ifx_lcd_set_FGcolor(COLOR_YELLOW, COLOR_YELLOW, COLOR_BLACK);   /* Yellow text */
        ifx_lcd_set_BGcolor(COLOR_BLACK, COLOR_BLACK, COLOR_BLACK);       /* Black background */
        ifx_lcd_printf(((DISPLAY_W - NUM_DISPLAY_OFFSET_15) / NUM_DISPLAY_OFFSET_2), LCD_TEXT_TOP_MARGIN, "ALMOST FULL");
    }
}


/********************************************************************************
* Function Name: display_database_full_overlay
*********************************************************************************
* Summary:
*  Display database full warning overlay (temporary, center screen)
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
static void display_database_full_overlay(void)
{
    /* Display prominent warning message */
    ifx_lcd_set_FGcolor(COLOR_WHITE, COLOR_WHITE, COLOR_WHITE); /* White text */
    ifx_lcd_set_BGcolor(COLOR_RED, COLOR_BLACK, COLOR_BLACK);     /* Red background for urgency */

    /* Main warning message */
    ifx_lcd_printf(ALIGN_CENTER, DISPLAY_H / NUM_DISPLAY_OFFSET_2 - NUM_DISPLAY_OFFSET_40, "DATABASE FULL!");

    /* Additional info */
    ifx_lcd_set_FGcolor(COLOR_YELLOW, COLOR_YELLOW, COLOR_BLACK);   /* Yellow text */
    ifx_lcd_set_BGcolor(COLOR_DARK_RED, COLOR_BLACK, COLOR_BLACK);     /* Dark red background */
    ifx_lcd_printf(ALIGN_CENTER, DISPLAY_H / NUM_DISPLAY_OFFSET_2 - NUM_DISPLAY_OFFSET_10, "MAX %d USERS ENROLLED", MAX_N_USER);
    ifx_lcd_printf(ALIGN_CENTER, DISPLAY_H / NUM_DISPLAY_OFFSET_2 + NUM_DISPLAY_OFFSET_20, "CLEAR USERS TO ADD NEW");


    ifx_lcd_set_FGcolor(COLOR_WHITE, COLOR_WHITE, COLOR_WHITE); /* White text */
    ifx_lcd_set_BGcolor(COLOR_BLACK, COLOR_BLACK, COLOR_DARK_BLUE);     /* Blue background */
    ifx_lcd_printf(ALIGN_CENTER, DISPLAY_H / NUM_DISPLAY_OFFSET_2 + NUM_DISPLAY_OFFSET_50, "TOUCH CLEAR BUTTON");
}


/********************************************************************************
* Function Name: ifx_copy_embeddings_to_nvm
*********************************************************************************
* Summary:
*  Copies a specified number of bytes from a source address to non-volatile memory
*  (NVM) at the given address, using a blocking API to perform the write operation.
*  Checks for AHB bus errors and updates the status accordingly.
*
* Parameters:
*  uint32_t nvm_addr: The address in non-volatile memory to write to
*  uint8_t *src_addr: Pointer to the source data to be copied
*  uint32_t num_bytes: Number of bytes to copy
*
* Return:
*  cy_en_rram_status_t: Status of the write operation (CY_RRAM_SUCCESS or error
*   code)
*
********************************************************************************/
static cy_en_rram_status_t ifx_copy_embeddings_to_nvm(uint32_t nvm_addr,
        uint8_t *src_addr,
        uint32_t num_bytes)
{
    cy_en_rram_status_t status = CY_RRAM_SUCCESS;

    CY_ASSERT(NULL != src_addr);

    taskENTER_CRITICAL();
    /* using blocking API as hardfault observed with non-blocking one */
    status = Cy_RRAM_NvmWriteByteArray(RRAMC0,
            nvm_addr,
            src_addr,
            num_bytes);
    if (CY_RRAM_SUCCESS == status)
    {
        cy_en_rram_hresp_t ahb_error = Cy_RRAM_GetAHBError(RRAMC0);
        if (CY_RRAM_AHB_NO_ERROR != ahb_error)
        {
            printf("[ERROR] AHB bus error while accessing NVM database 0x%08x\r\n", ahb_error);
            printf("[INFO] NVM status 0x%08" PRIx32 "\r\n", Cy_RRAM_GetStatus(RRAMC0));

            status = CY_RRAM_WRITE_OPERATION_ERROR;
        }
    }

    taskEXIT_CRITICAL();

    return status;
}


#ifdef PLOT_ALIGNED_FACES

/********************************************************************************
* Function Name: plot_aligned_faces_bottom
*********************************************************************************
* Summary:
*  Plot just the first aligned face at bottom of screen
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
static void plot_aligned_faces_bottom()
{
    ifx_faceid_rslt_t result;

    result = ifx_face_id_get_aligned_faces(&aligned_faces);
    if (result != IFX_FACEID_RSLT_SUCCESS || aligned_faces.num_aligned_faces == RESET_VALUE_INDEX)
    {
        return;
    }

    /* Use the int8_t display function directly */
    ifx_lcd_display_Rect_i8(PLOT_ALIGNED_X, PLOT_ALIGNED_Y,
            aligned_faces.aligned_faces,  /* int8_t data */
            aligned_faces.face_width,
            aligned_faces.face_height);
}
#endif /* PLOT_ALIGNED_FACES */


/********************************************************************************
* Function Name: i2c_controller_interrupt
*********************************************************************************
* Summary:
*  I2C controller ISR which invokes Cy_SCB_I2C_Interrupt to perform I2C transfer
*  as controller.
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
static void i2c_controller_interrupt(void)
{
    Cy_SCB_I2C_Interrupt(DISPLAY_I2C_CONTROLLER_HW, &disp_i2c_controller_context);
}


/********************************************************************************
* Function Name: touch_read_timer_cb
*********************************************************************************
* Summary:
*  Timer callback function that reads touch input from a CTP FT5406 touch
*  controller, processes touch events for button interactions, and handles
*  debouncing. Updates touch button states for face enrolment, cancel, and
*  clear enrolled users buttons based on touch coordinates and device connection
*  status.
*
* Parameters:
*  TimerHandle_t xTimer: Handle to the timer that triggered the callback
*
* Return:
*  void
*
********************************************************************************/
static void touch_read_timer_cb(TimerHandle_t xTimer)
{
    #if defined(USE_KIT_PSE84_HMI)
    cy_rslt_t result;
    #else
    cy_en_scb_i2c_status_t i2c_status = CY_SCB_I2C_SUCCESS;
    mtb_ctp_touch_event_t touch_event = MTB_CTP_TOUCH_UP;
    #endif
    static int touch_x = RESET_VALUE_INDEX;
    static int touch_y = RESET_VALUE_INDEX;
    volatile int x_val = RESET_VALUE_INDEX;
    volatile int y_val = RESET_VALUE_INDEX;

    #if defined(USE_KIT_PSE84_HMI)
    result = mtb_ctp_ft5446_get_single_touch(&touch_x, &touch_y);
    if ((CY_RSLT_SUCCESS == result) || button_debouncing)
    #else
    i2c_status = mtb_ctp_ft5406_get_single_touch(&touch_event, &touch_x, &touch_y);

    if ((CY_SCB_I2C_SUCCESS == i2c_status) &&
            ((MTB_CTP_TOUCH_DOWN == touch_event) || (MTB_CTP_TOUCH_CONTACT == touch_event)))
    #endif
    {
        if (!button_debouncing)
        {
            /* Set the debouncing flag */
            button_debouncing = true;

            /* Record the current timestamp */
            button_debounce_timestamp = (uint32_t) (xTaskGetTickCount());
        }

