Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
        if (button_debouncing && ((xTaskGetTickCount() - button_debounce_timestamp) >= pdMS_TO_TICKS(DEBOUNCE_TIME_MS)))
        {
            button_debouncing = false;
            #if defined(USE_KIT_PSE84_HMI)
            x_val = touch_x;
            y_val = touch_y;
            #else
            x_val = ((ifx_lcd_get_Display_Width() - NUM_LOOP_INCREMENT_1) - NUM_DISPLAY_OFFSET_32) - touch_x;
            y_val = (ifx_lcd_get_Display_Height() - NUM_LOOP_INCREMENT_1) - touch_y;
            #endif

            /* Start/Save Face Enrolment Button */
            if (_device_connected && (x_val >= (int)(FACE_ENROL_BTN_X_POS - NUM_TOUCH_OFFSET_10)) && (x_val <= (int)(FACE_ENROL_BTN_X_POS + START_FACE_ENROLMENT_BUTTON_WIDTH)) &&
                    (y_val >= (int)(FACE_ENROL_BTN_Y_POS - NUM_TOUCH_OFFSET_10)) && (y_val <= (int)(FACE_ENROL_BTN_Y_POS + START_FACE_ENROLMENT_BUTTON_HEIGHT)))
            {
                switch (touch_button_event[FACE_ENROL_BUTTON_ID].event)
                {
                case TOUCH_BUTTON_EVENT_RELEASED:
                    touch_button_event[FACE_ENROL_BUTTON_ID].event = TOUCH_BUTTON_EVENT_PRESSED;
                    touch_button_event[FACE_ENROL_BUTTON_ID].pressed = true;
                    touch_button_event[FACE_ENROL_BUTTON_ID].released = false;
                    break;

                case TOUCH_BUTTON_EVENT_PRESSED:
                    touch_button_event[FACE_ENROL_BUTTON_ID].event = TOUCH_BUTTON_EVENT_RELEASED;
                    touch_button_event[FACE_ENROL_BUTTON_ID].pressed = false;
                    touch_button_event[FACE_ENROL_BUTTON_ID].released = true;
                    break;
                }
            }
            /* Cancel Face Enrolment Button */
            else if (_device_connected && (x_val >= (int)(CANCEL_BTN_X_POS - NUM_TOUCH_OFFSET_10)) && (x_val <= (int)(CANCEL_BTN_X_POS + CANCEL_RELEASED_BUTTON_WIDTH)) &&
                    (y_val >= (int)(CANCEL_BTN_Y_POS - NUM_TOUCH_OFFSET_5)) && (y_val <= (int)(CANCEL_BTN_Y_POS + CANCEL_RELEASED_BUTTON_HEIGHT)))
            {
                touch_button_event[CANCEL_ENROL_BUTTON_ID].event = TOUCH_BUTTON_EVENT_PRESSED;
                touch_button_event[CANCEL_ENROL_BUTTON_ID].pressed = true;
            }
            /* Clear Enrolled Users Button */
            else if (_device_connected && (x_val >= (int)(CLEAR_BTN_X_POS - NUM_TOUCH_OFFSET_10)) && (x_val <= (int)(CLEAR_BTN_X_POS + CLEAR_RELEASED_BUTTON_WIDTH)) &&
                    (y_val >= (int)(CLEAR_BTN_Y_POS - NUM_TOUCH_OFFSET_5)) && (y_val <= (int)(CLEAR_BTN_Y_POS + CLEAR_RELEASED_BUTTON_HEIGHT)))
            {
                touch_button_event[CLEAR_ENROL_BUTTON_ID].event = TOUCH_BUTTON_EVENT_PRESSED;
                touch_button_event[CLEAR_ENROL_BUTTON_ID].pressed = true;
            }
        }
    }
}


/********************************************************************************
* Function Name: touch_input_dev_init
*********************************************************************************
* Summary:
*  Initializes the touch input device using the CTP FT5406 touch controller and
*  creates a periodic timer to read touch inputs. Starts the timer to trigger the
*  touch_read_timer_cb callback function periodically.
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
static void touch_input_dev_init(void)
{
    cy_en_scb_i2c_status_t i2c_status = CY_SCB_I2C_SUCCESS;
    TimerHandle_t touch_timer_handle;

    #if defined(USE_KIT_PSE84_HMI)
    cy_en_sysint_status_t sysint_status = CY_SYSINT_SUCCESS;
    cy_rslt_t result;

    /* Initialize the I2C in controller mode. */
    i2c_status = Cy_SCB_I2C_Init(DISPLAY_I2C_CONTROLLER_HW,
            &DISPLAY_I2C_CONTROLLER_config, &disp_i2c_controller_context);

    if (CY_SCB_I2C_SUCCESS != i2c_status)
    {
        printf("I2C controller initialization failed !!\r\n");
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }

    /* Initialize the I2C interrupt */
    sysint_status = Cy_SysInt_Init(&i2c_controller_irq_cfg,
            &i2c_controller_interrupt);

    if (CY_SYSINT_SUCCESS != sysint_status)
    {
        printf("I2C controller interrupt initialization failed\r\n");
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }

    /* Enable the I2C interrupts. */
    NVIC_EnableIRQ(i2c_controller_irq_cfg.intrSrc);

    /* Enable the I2C */
    Cy_SCB_I2C_Enable(DISPLAY_I2C_CONTROLLER_HW);

    /* Allow I2C to be stabalized to initialize the display */
    Cy_SysLib_Delay(I2C_DELAY_MS);

    result = mtb_ctp_ft5446_init(&ctp_ft5446_config);

    if (CY_RSLT_SUCCESS != result)
    {
        printf("[ERROR] Touch driver initialization failed: %d\r\n",  (unsigned int) result);
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }

    #else
    i2c_status = mtb_ctp_ft5406_init(&ft5406_config);

    if (CY_SCB_I2C_SUCCESS != i2c_status)
    {
        printf("[ERROR] Touch driver initialization failed: %d\r\n", i2c_status);
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }
    #endif

    touch_timer_handle = xTimerCreate("touch_read_timer",
            pdMS_TO_TICKS(TOUCH_TIMER_PERIOD_MS),
            pdTRUE,
            (void*)RESET_VALUE_INDEX,
            touch_read_timer_cb);

    if (touch_timer_handle != NULL)
    {
        xTimerStart(touch_timer_handle, NUM_TIMER_START_VALUE);
    }
    else
    {
        printf("[ERROR] Touch read timer creation failed\r\n");
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }
}


/********************************************************************************
* Function Name: cleanup
*********************************************************************************
* Summary:
*  Deallocates all resources and frees up memory by closing the vector graphics
*  library.
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
inline static void cleanup(void)
{
    /* Deallocate all the resource and free up all the memory */
    vg_lite_close();
}


/********************************************************************************
* Function Name: init_buffer_system
*********************************************************************************
* Summary:
*  Initializes the buffer system by resetting image buffer states, clearing the
*  last buffer index, and resetting timeout tracking variables for a clean startup.
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
static void init_buffer_system(void)
{
    printf("[LCD_TASK] Initializing buffer system\n");

    /* Ensure clean startup state */
    for (int i = NUM_LOOP_START; i < NUM_IMAGE_BUFFERS; i++)
    {
        _ImageBuff[i].BufReady = RESET_VALUE_INDEX;
        _ImageBuff[i].NumBytes = RESET_VALUE_INDEX;
    }
    __DMB();

    lastBuffer = RESET_VALUE_INDEX;
    __DMB();

    /* Reset timeout tracking */
    last_successful_frame_time = RESET_VALUE_INDEX;
    recovery_attempts = RESET_VALUE_INDEX;

    printf("[LCD_TASK] Buffer system initialized\n");
}


/********************************************************************************
* Function Name: draw_filled_rect_to_framebuffer
*********************************************************************************
* Summary:
*  Draws a filled rectangle directly to the framebuffer with the specified RGB565
*  color, clamping coordinates to ensure they are within the display bounds.
*
* Parameters:
*  uint16_t *framebuffer: Pointer to the framebuffer to draw to
*  int width: Width of the framebuffer
*  int height: Height of the framebuffer
*  int x1: Starting x-coordinate of the rectangle
*  int y1: Starting y-coordinate of the rectangle
*  int x2: Ending x-coordinate of the rectangle
*  int y2: Ending y-coordinate of the rectangle
*  uint16_t rgb565_color: Color of the rectangle in RGB565 format
*
* Return:
*  void
*
********************************************************************************/
static void draw_filled_rect_to_framebuffer(uint16_t *framebuffer, int width, int height,
        int x1, int y1, int x2, int y2, uint16_t rgb565_color)
{
    /* Clamp coordinates to display bounds */
    if (x1 < (int)RESET_VALUE_INDEX) x1 = (int)RESET_VALUE_INDEX;
    if (y1 < (int)RESET_VALUE_INDEX) y1 = (int)RESET_VALUE_INDEX;
    if (x2 >= width) x2 = width - NUM_LOOP_INCREMENT_1;
    if (y2 >= height) y2 = height - NUM_LOOP_INCREMENT_1;

    if (x1 >= x2 || y1 >= y2) return;  /* Invalid rectangle */

    /* Fill the rectangle directly in the framebuffer */
    for (int y = y1; y <= y2; y++) {
        uint16_t *row_ptr = &framebuffer[y * width + x1];
        for (int x = NUM_LOOP_START; x <= (x2 - x1); x++) {
            row_ptr[x] = rgb565_color;
        }
    }
}


/********************************************************************************
* Function Name: is_enrollment_complete
*********************************************************************************
* Summary:
*  Checks if all poses in the enrolment process are completed by examining the
*  enrolment progress structure.
*
* Parameters:
*  ifx_on_dev_enroll_stats_t *progress: Pointer to the enrolment progress
*  structure
*
* Return:
*  bool: True if all poses are completed, false otherwise
*
********************************************************************************/
static bool is_enrollment_complete(ifx_on_dev_enroll_stats_t *progress)
{
    if (progress == NULL)
    {
        return false;
    }

    for (int i = NUM_LOOP_START; i < progress->num_poses; i++)
    {
        if (progress->enroll_progress[i] != PROGRESS_COMPLETED)
        {
            return false;
        }
    }

    printf("[LCD_TASK] All %d poses completed - auto-completing enrolment\n", progress->num_poses);
    return true;
}

/********************************************************************************
* Function Name: draw_enrollment_progress_grid
*********************************************************************************
* Summary:
*  Draws a grid in the top-right corner of the display to show enrolment progress
*  for each pose, with color-coded cells indicating progress status (not started,
*  in progress, completed). Includes a title, pose labels, and a legend. Updates
*  the display with the drawn grid.
*
* Parameters:
*  ifx_on_dev_enroll_stats_t *progress: Pointer to the enrolment progress status
*                                       structure
*  int current_pose: Index of the current pose being processed (-1 if none or
*                    out of range)
*  ifx_faceid_prediction_t *prediction: Pointer to the current face detection
*                                       prediction data.
*  ifx_enrollment_config_t *config: Pointer to the enrolment configuration
*                                   structure
*
* Return:
*  void
*
********************************************************************************/
static void draw_enrollment_progress_grid(ifx_on_dev_enroll_stats_t *progress, int current_pose, ifx_faceid_prediction_t *prediction, ifx_enrollment_config_t *config)
{
    const int grid_size = GRID_SIZE;         /* Size of each grid cell */
    const int grid_spacing = GRID_SPACING;      /* Spacing between cells */
    const int text_offset_y = TEXT_OFFSET_Y;     /* Offset for better text centering vertically */
    const int text_offset_x = TEXT_OFFSET_X;      /* Small offset from left edge */

    /* Determine grid dimensions and layout based on num_poses */
    int grid_rows, grid_cols;
    int pose_positions[MAX_NUM_POSES][2]; /* [pose_idx][row, col] - enough space for any layout */

