Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
    if (config->num_poses == NUM_DISPLAY_OFFSET_3)
    {
        grid_rows = NUM_GRID_ROWS_1;
        grid_cols = NUM_GRID_COLS_3;
        /* Linear layout: Left, Front, Right */
        pose_positions[NUM_LOOP_START][NUM_LOOP_START] = RESET_VALUE_INDEX; pose_positions[NUM_LOOP_START][NUM_LOOP_INCREMENT_1] = RESET_VALUE_INDEX;  /* Left */
        pose_positions[NUM_LOOP_INCREMENT_1][NUM_LOOP_START] = RESET_VALUE_INDEX; pose_positions[NUM_LOOP_INCREMENT_1][NUM_LOOP_INCREMENT_1] = NUM_LOOP_INCREMENT_1;  /* Front */
        pose_positions[NUM_DISPLAY_OFFSET_2][NUM_LOOP_START] = RESET_VALUE_INDEX; pose_positions[NUM_DISPLAY_OFFSET_2][NUM_LOOP_INCREMENT_1] = NUM_DISPLAY_OFFSET_2;  /* Right */
    }
    else if (config->num_poses == 5)
    {
        grid_rows = 3;
        grid_cols = 3;
        /* Cross layout: Up, Down, Left, Right, Front (center) */
        pose_positions[0][0] = 0; pose_positions[0][1] = 1;  /* Up (top center) */
        pose_positions[1][0] = 2; pose_positions[1][1] = 1;  /* Down (bottom center) */
        pose_positions[2][0] = 1; pose_positions[2][1] = 0;  /* Left (middle left) */
        pose_positions[3][0] = 1; pose_positions[3][1] = 2;  /* Right (middle right) */
        pose_positions[4][0] = 1; pose_positions[4][1] = 1;  /* Front (center) */
    }
    else
    { /* config->num_poses == 9 */
        grid_rows = 3;
        grid_cols = 3;
        /* Full 3x3 grid */
        for (int i = 0; i < 9; i++)
        {
            pose_positions[i][0] = i / 3;  /* row */
            pose_positions[i][1] = i % 3;  /* col */
        }
    }

    /* Position in bottom right corner */
    const int grid_x = DISPLAY_W - ((grid_size + grid_spacing) * grid_cols + grid_spacing + 40);
    const int grid_y = DISPLAY_H - ((grid_size + grid_spacing) * grid_rows + grid_spacing + 100);

    /* Create RGB565 colors for each state */
    const uint16_t color_not_started = RGB565(255, 165, 0);  /* Orange */
    const uint16_t color_in_progress = RGB565(255, 0, 255);  /* Magenta */
    const uint16_t color_completed = RGB565(0, 255, 0);      /* Green */
    const uint16_t color_black = RGB565(0, 0, 0);            /* Black for border */
    const uint16_t color_red = RGB565(255, 0, 0);            /* Red for current pose highlight */
    const uint16_t color_dark_gray = RGB565(64, 64, 64);     /* Dark gray for background */

    /* Draw background for the entire grid area (dark gray) */
    draw_filled_rect_to_framebuffer(LCD_Addr, DISPLAY_W, DISPLAY_H,
            grid_x - 20,
            grid_y - 20,
            grid_x + (grid_size + grid_spacing) * grid_cols + 20,
            grid_y + (grid_size + grid_spacing) * grid_rows + 80,
            color_dark_gray);

    /* For 5-pose layout, first fill empty positions with dark gray */
    if (config->num_poses == 5)
    {
        for (int row = 0; row < grid_rows; row++)
        {
            for (int col = 0; col < grid_cols; col++)
            {
                /* Check if this position is used by any pose */
                bool position_used = false;
                for (int pose_idx = 0; pose_idx < config->num_poses; pose_idx++)
                {
                    if (pose_positions[pose_idx][0] == row && pose_positions[pose_idx][1] == col)
                    {
                        position_used = true;
                        break;
                    }
                }

                /* Fill unused positions with darker background */
                if (!position_used)
                {
                    int x = grid_x + col * (grid_size + grid_spacing);
                    int y = grid_y + row * (grid_size + grid_spacing);
                    draw_filled_rect_to_framebuffer(LCD_Addr, DISPLAY_W, DISPLAY_H,
                            x, y, x + grid_size, y + grid_size, color_dark_gray);
                }
            }
        }
    }

    /* Draw grid showing progress for each pose */
    for (int pose_idx = 0; pose_idx < config->num_poses; pose_idx++)
    {
        int row = pose_positions[pose_idx][0];
        int col = pose_positions[pose_idx][1];

        int x = grid_x + col * (grid_size + grid_spacing);
        int y = grid_y + row * (grid_size + grid_spacing);
        uint16_t color = 0;
        uint16_t border_color = color_black;  /* Default border color */
        int border_thickness = 3;             /* Default border thickness */

        /* Set color based on progress state */
        switch (progress->enroll_progress[pose_idx])
        {
        case PROGRESS_NOT_STARTED:
            color = color_not_started;
            break;
        case PROGRESS_IN_PROGRESS:
            color = color_in_progress;
            break;
        case PROGRESS_COMPLETED:
            color = color_completed;
            break;
        default:
            color = RGB565(128, 128, 128);  /* Gray fallback */
            break;
        }

        /* Check if this is the current pose - highlight with red border and make it thicker */
        if (current_pose == pose_idx)
        {
            border_color = color_red;
            border_thickness = 5;  /* Thicker border for current pose */
        }

        /* Draw border with appropriate color and thickness */
        draw_filled_rect_to_framebuffer(LCD_Addr, DISPLAY_W, DISPLAY_H,
                x - border_thickness, y - border_thickness,
                x + grid_size + border_thickness, y + grid_size + border_thickness,
                border_color);

        /* Draw the colored grid cell */
        draw_filled_rect_to_framebuffer(LCD_Addr, DISPLAY_W, DISPLAY_H,
                x, y,
                x + grid_size, y + grid_size,
                color);

        /* Extract RGB components from RGB565 color for background */
        uint8_t bg_r = ((color >> HEX_BIT_SHIFT_11) & HEX_RED_5BIT_MASK) << HEX_BIT_SHIFT_3;  /* Red: 5 bits to 8 bits */
        uint8_t bg_g = ((color >> HEX_BIT_SHIFT_5) & HEX_GREEN_6BIT_MASK) << HEX_BIT_SHIFT_2;   /* Green: 6 bits to 8 bits */
        uint8_t bg_b = (color & HEX_BLUE_5BIT_MASK) << HEX_BIT_SHIFT_3;          /* Blue: 5 bits to 8 bits */

        /* Draw pose label with proper positioning */
        char label[CHAR_STRING_LEN];

        /* Split long names into two lines if needed */
        const char* pose_name = progress->pose_names[pose_idx];
        if (strstr(pose_name, "-")) {
            /* Split at the hyphen for two-word names */
            char line1[CHAR_STRING_LEN], line2[CHAR_STRING_LEN];
            const char* hyphen_pos = strchr(pose_name, '-');
            int len1 = hyphen_pos - pose_name;

            strncpy(line1, pose_name, len1);
            line1[len1] = '\0';
            strcpy(line2, hyphen_pos + 1);

            /* Draw first line */
            ifx_lcd_set_FGcolor(255, 255, 255);  /* White text */
            ifx_lcd_set_BGcolor(bg_r, bg_g, bg_b);  /* Set background to match cell color */
            ifx_lcd_printf(x + text_offset_x, y + text_offset_y - 8, line1);

            /* Draw second line */
            ifx_lcd_printf(x + text_offset_x, y + text_offset_y + 8, line2);
        }
        else
        {
            /* Single line for simple names */
            sprintf(label, "%s", pose_name);
            ifx_lcd_set_FGcolor(0, 0, 0);  /* Black text */
            ifx_lcd_set_BGcolor(bg_r, bg_g, bg_b);  /* Set background to match cell color */
            ifx_lcd_printf(x + text_offset_x, y + text_offset_y, label);
        }
    }

    /* Add title above the grid */
    ifx_lcd_set_FGcolor(255, 255, 255);  /* White text */
    ifx_lcd_set_BGcolor(64, 64, 64);     /* Dark gray background */
    int title_x = grid_x + ((grid_size + grid_spacing) * grid_cols) / 2 - TITLE_X_OFFSET;
    ifx_lcd_printf(title_x, grid_y - TITLE_Y_OFFSET, "HEAD POSE PROGRESS");

    /* Vertical legend at the bottom right, each item on new line */
    int legend_x = grid_x + (grid_size + grid_spacing) * grid_cols - 100;  /* Right side of grid */
    int legend_y = grid_y + (grid_size + grid_spacing) * grid_rows + 10;
    int line_height = LINE_HEIGHT;

    /* Not Started */
    draw_filled_rect_to_framebuffer(LCD_Addr, DISPLAY_W, DISPLAY_H,
            legend_x, legend_y,
            legend_x + LEGEND_SQUARE_SIZE, legend_y + LEGEND_SQUARE_SIZE,
            color_not_started);
    ifx_lcd_set_BGcolor(64, 64, 64);  /* Back to dark gray for text */
    ifx_lcd_printf(legend_x + LEGEND_TEXT_OFFSET, legend_y + LEGEND_Y_OFFSET, "Not Started");

    /* In Progress */
    legend_y += line_height;
    draw_filled_rect_to_framebuffer(LCD_Addr, DISPLAY_W, DISPLAY_H,
            legend_x, legend_y,
            legend_x + LEGEND_SQUARE_SIZE, legend_y + LEGEND_SQUARE_SIZE,
            color_in_progress);
    ifx_lcd_printf(legend_x + LEGEND_TEXT_OFFSET, legend_y + LEGEND_Y_OFFSET, "In Progress");

