Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
    /* Completed */
    legend_y += line_height;
    draw_filled_rect_to_framebuffer(LCD_Addr, DISPLAY_W, DISPLAY_H,
            legend_x, legend_y,
            legend_x + LEGEND_SQUARE_SIZE, legend_y + LEGEND_SQUARE_SIZE,
            color_completed);
    ifx_lcd_printf(legend_x + LEGEND_TEXT_OFFSET, legend_y + LEGEND_Y_OFFSET, "Completed");

    /* Important: Update the display after all drawing is complete */
    ifx_lcd_draw_Buffer();
    __DMB();
}


/********************************************************************************
* Function Name: update_enrollment_display
*********************************************************************************
* Summary:
*  Updates the LCD display with pose-specific information during on-device face
*  enrolment, showing progress, guidance messages, and feedback based on the
*  enrolment state and face detection results. Displays a progress grid and
*  handles auto-completion or manual completion instructions.
*
* Parameters:
*  ifx_faceid_prediction_t *prediction: Pointer to the face detection prediction
*                                       data
*  ifx_enrollment_config_t *enrollment_config: Pointer to the enrolment
*                                              configuration structure
*  enrollment_state_t state: Current state of the enrolment process
*  enrollment_type_t type: Type of enrolment (e.g., on-device)
*  ifx_on_dev_enroll_stats_t *progress: Pointer to the enrolment progress status
*                                      structure
*  ifx_faceid_rslt_t enrollment_feedback: Feedback result from the enrolment
*                                         process
*
* Return:
*  void
*
********************************************************************************/
static void update_enrollment_display(ifx_faceid_prediction_t *prediction,
        ifx_enrollment_config_t *enrollment_config,
        enrollment_state_t state,
        enrollment_type_t type,
        ifx_on_dev_enroll_stats_t *progress,
        ifx_faceid_rslt_t enrollment_feedback)
        {
    if (type != ENROLLMENT_TYPE_ON_DEVICE)
    {
        return; /* Only show special display for on-device enrolment */
    }

    /* No need to get enrolment progress here since it's passed in */
    if (progress == NULL)
    {
        printf("[LCD_TASK][ERROR] No enrolment progress data available\n");
        return; /* Can't display without progress data */
    }

    /* Calculate current pose index for highlighting */
    int current_pose = -1;  /* Default to no pose detected */
    if (prediction->count == 1)
    {
        /* Use the same pose detection logic as in the enrolment system */
        /* If pose is out of range, the API will return -1 */
        current_pose = ifx_face_id_get_pose_bin_index(enrollment_config, prediction->yaw[0], prediction->pitch[0], prediction->roll[0]);
    }

    /* Draw the progress grid with current pose highlighting */
    draw_enrollment_progress_grid(progress, current_pose, prediction, enrollment_config);

    /* Show enrolment state */
    ifx_lcd_set_FGcolor(COLOR_WHITE, COLOR_WHITE, COLOR_WHITE); /* White text */
    ifx_lcd_set_BGcolor(0, 0, 128);     /* Dark blue background */

    if (state == ENROLLMENT_STATE_WAITING_FOR_REFERENCE)
    {
        ifx_lcd_printf(ALIGN_LEFT, 40, "WAITING FOR REFERENCE FACE");

        /* Show guidance for getting a good reference face */
        if (prediction->count == 1)
        {
            float conf_pct = prediction->conf[0] * 100.0f;

            if (conf_pct >= 90.0f && prediction->frontal_face[0])
            {
                ifx_lcd_set_FGcolor(0, 255, 0);  /* Green text */
                ifx_lcd_printf(ALIGN_LEFT, 70, "GOOD FACE DETECTED! HOLD STEADY");
            }
            else
            {
                ifx_lcd_set_FGcolor(255, 0, 0);  /* Red text */
                ifx_lcd_printf(ALIGN_LEFT, 70, "LOOK DIRECTLY AT CAMERA (%.1f%%)", conf_pct);
            }
        }
        else if (prediction->count > 1)
        {
            ifx_lcd_set_FGcolor(255, 0, 0);  /* Red text */
            ifx_lcd_printf(ALIGN_LEFT, 70, "TOO MANY FACES (%d). NEED JUST ONE.", prediction->count);
        }
        else
        {
            ifx_lcd_set_FGcolor(255, 0, 0);  /* Red text */
            ifx_lcd_printf(ALIGN_LEFT, 70, "NO FACE DETECTED");
        }

    }
    else if (state == ENROLLMENT_STATE_COLLECTING)
    {
        ifx_lcd_printf(ALIGN_LEFT, 40, "COLLECTING POSES");

        /* Count completed and in-progress poses */
        int complete = 0;
        int in_progress = 0;
        for (int i = NUM_LOOP_START; i < progress->num_poses; i++)
        {
            if (progress->enroll_progress[i] == PROGRESS_COMPLETED)
            {
                complete++;
            }
            else if (progress->enroll_progress[i] == PROGRESS_IN_PROGRESS)
            {
                in_progress++;
            }
        }

        /* Show progress counts */
        ifx_lcd_set_FGcolor(255, 255, 255);  /* White text */
        ifx_lcd_printf(ALIGN_LEFT, 70, "PROGRESS: %d COMPLETE, %d IN PROGRESS", complete, in_progress);

        /* Show specific feedback based on enrolment result */
        if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_POSE_REF_LOW_CONF)
        {
            /* Show specific message for low pose reference confidence */
            ifx_lcd_set_FGcolor(255, 165, 0);  /* Orange text */
            ifx_lcd_printf(ALIGN_LEFT, 100, "HOLD CURRENT POSE STEADY - QUALITY TOO LOW");
        }
        else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_POSE_OUT_OF_RANGE)
        {
            ifx_lcd_set_FGcolor(255, 0, 0);  /* Red text */
            ifx_lcd_printf(ALIGN_LEFT, 100, "ADJUST HEAD POSE TO SUPPORTED RANGE");
        }
        else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_FACE_AT_BOUNDARY)
        {
            ifx_lcd_set_FGcolor(255, 0, 0);  /* Red text */
            ifx_lcd_printf(ALIGN_LEFT, 100, "MOVE AWAY FROM IMAGE EDGES");
        }
        else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_MULTI_FACE)
        {
            /* Handle multiple faces detected */
            ifx_lcd_set_FGcolor(255, 0, 0);  /* Red text */
            ifx_lcd_printf(ALIGN_LEFT, 100, "TOO MANY FACES - ONLY ONE PERSON ALLOWED");
        }
        else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_LOW_SIM_MAIN_REF)
        {
            /* Handle low similarity (different person) */
            ifx_lcd_set_FGcolor(128, 0, 128);  /* Purple text */
            ifx_lcd_printf(ALIGN_LEFT, 100, "FACE TOO DIFFERENT TO MAIN REFERENCE");
        }
        else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_LOW_SIM_POSE_REF)
        {
            /* Handle low similarity (different person) */
            ifx_lcd_set_FGcolor(128, 0, 128);  /* Purple text */
            ifx_lcd_printf(ALIGN_LEFT, 100, "FACE TOO DIFFERENT TO POSE REFERENCE");
        }
        else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_POSE_COMPLETE)
        {
            /* Handle pose completion */
            ifx_lcd_set_FGcolor(0, 255, 0);  /* Bright green text */
            if ((uint32_t)current_pose < (uint32_t)progress->num_poses) {
                ifx_lcd_printf(ALIGN_LEFT, 100, "EXCELLENT! %s POSE COMPLETED", progress->pose_names[current_pose]);
            } else {
                ifx_lcd_printf(ALIGN_LEFT, 100, "EXCELLENT! POSE COMPLETED");
            }
        }
        else
        {
            /* Default instruction */
            ifx_lcd_set_FGcolor(255, 255, 0);  /* Yellow text */
            ifx_lcd_printf(ALIGN_LEFT, 100, "MOVE HEAD SLOWLY IN DIFFERENT POSES");
        }

