Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
        /* AUTO-COMPLETION LOGIC */
        /* Check if we're ready for auto-completion or show manual completion option */
        if (complete == progress->num_poses)
        {
            /* All poses completed - show auto-completion message */
            ifx_lcd_set_FGcolor(0, 255, 0);  /* Bright green text */
            ifx_lcd_set_BGcolor(0, 128, 0);  /* Dark green background */
            ifx_lcd_printf(ALIGN_LEFT, 130, "ALL POSES COMPLETE - AUTO-SAVING...");
        }
        else
        {
            /* Still collecting poses - show manual completion option */

            ifx_lcd_set_FGcolor(255, 255, 255);  /* White text */
            ifx_lcd_set_BGcolor(0, 0, 128);      /* Dark blue background */
            ifx_lcd_printf(ALIGN_LEFT, 130, "TOUCH BUTTON TO FINISH EARLY OR WAIT FOR AUTO-COMPLETE");
        }
    }
    else if (state == ENROLLMENT_STATE_COMPLETING)
    {
        ifx_lcd_set_FGcolor(255, 255, 255);  /* White text */
        ifx_lcd_set_BGcolor(0, 0, 128);      /* Dark blue background */
        ifx_lcd_printf(ALIGN_LEFT, 40, "PROCESSING ENROLLMENT...");

        /* Show a completion status message */
        ifx_lcd_set_FGcolor(0, 255, 0);      /* Green text */
        ifx_lcd_set_BGcolor(0, 128, 0);      /* Dark green background */
        ifx_lcd_printf(ALIGN_LEFT, 70, "SAVING USER TO DATABASE...");
    }
}


/********************************************************************************
* Function Name: dc_irq_handler
*********************************************************************************
* Summary:
*  Interrupt handler for the display controller (DC) that clears the DC interrupt
*  using the graphics subsystem context.
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
static void dc_irq_handler(void)
{
    Cy_GFXSS_Clear_DC_Interrupt(base, &gfx_context);
}


/********************************************************************************
* Function Name: gpu_irq_handler
*********************************************************************************
* Summary:
*  Interrupt handler for the GPU that clears the GPU interrupt using the graphics
*  subsystem context and calls the vector graphics library interrupt handler.
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
static void gpu_irq_handler(void)
{
    Cy_GFXSS_Clear_GPU_Interrupt(base, &gfx_context);
    vg_lite_IRQHandler();
}


/********************************************************************************
* Function Name: update_lcd_display
*********************************************************************************
* Summary:
*  Updates the LCD display with face detection information, rendering camera
*  images,bounding boxes, and enrolment-specific visualizations. Handles
*  different display modes (inference and enrolment), shows database status,
*  and provides timing information. Supports optional features like head pose
*  axes, facial landmarks, and aligned face plotting.
*
* Parameters:
*  ifx_faceid_prediction_t *prediction: Pointer to the face detection prediction
*                                       data
*  display_mode_t current_display_mode: Current mode of the display
*                                       (e.g., inference or enrolment)
*  ifx_faceid_rslt_t enrollment_feedback: Feedback result from the enrolment
*                                         process
*  ifx_enrollment_config_t *enrollment_config: Pointer to the enrolment
*                                              configuration structure
*
* Return:
*  void
*
********************************************************************************/
void update_lcd_display(ifx_faceid_prediction_t *prediction,
        display_mode_t current_display_mode,
        ifx_faceid_rslt_t enrollment_feedback,
        ifx_enrollment_config_t *enrollment_config )
{
    int16_t * bbox;
    int     id, cid, xtext, ytext;
    int16_t xmin, ymin, xmax, ymax;
    char display_name[2*CHAR_STRING_LEN]; /* give some headroom */

    /* Clear renderTarget buffer */
    float time_draw_start = get_time_in_ms();
    vg_lite_error_t error = vg_lite_clear(renderTarget, NULL, BLACK_COLOR);
    if (error)
    {
        printf("\r\n[LCD_TASK][ERROR] vg_lite_clear() returned error %d\r\n", error);
        cleanup();
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }

    /* Draw camera image */
    error = vg_lite_blit(renderTarget,
            &bgr565,
            &matrix,
            VG_LITE_BLEND_NONE,
            0,
            VG_LITE_FILTER_POINT);
    if (error)
    {
        printf("\r\n[LCD_TASK][ERROR] vg_lite_blit() (320x240 BGR565 ==> display BGR565) returned error %d\r\n", error);
        cleanup();
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }
    /* ensure that the GPU operations complete before continuing */
    vg_lite_flush();
    vg_lite_finish();    /* need to wait for completion ? */
    float time_draw_end = get_time_in_ms();
    Prep_bgr565_to_Disp = time_draw_end - time_draw_start;

    /* Draw detected faces with enrolment-aware styling */
    for (int i = 0; i < prediction->count; i++)
    {
        bbox = &prediction->bbox_int16[i << 2];
        id = prediction->id[i];
        #ifdef USE_KIT_PSE84_HMI
        /* HMI_BBOX_ROTATION_OFFSET_X corrects the horizontal bbox position after the
        * 90 CW rotation applied to the camera image on the KIT_PSE84_HMI. */
        xmin  = (int16_t)(bbox[0] * scale_Cam2Disp) + display_offset_x + HMI_BBOX_ROTATION_OFFSET_X;
        xmax  = (int16_t)(bbox[2] * scale_Cam2Disp) + display_offset_x + HMI_BBOX_ROTATION_OFFSET_X;
        #else
        xmin  = (int16_t)(bbox[0] * scale_Cam2Disp) + display_offset_x;
        xmax  = (int16_t)(bbox[2] * scale_Cam2Disp) + display_offset_x;
        #endif
        ymin  = (int16_t)(bbox[1] * scale_Cam2Disp) + display_offset_y;
        ymax  = (int16_t)(bbox[3] * scale_Cam2Disp) + display_offset_y;

