Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
        xmin = min(max(xmin, 1), DISPLAY_W-1);
        ymin = min(max(ymin, 1), DISPLAY_H-1);
        xmax = min(max(xmax, 1), DISPLAY_W-1);
        ymax = min(max(ymax, 1), DISPLAY_H-1);

        xtext = xmin;
        ytext = (ymin - 16 >= 0) ? ymin - 16 : ymax;

        /* Different styling based on display mode */
        if (current_display_mode == DISPLAY_MODE_ENROLLMENT)
        {
            /* ENROLLMENT MODE: Simple green boxes with minimal text */
            ifx_lcd_set_FGcolor(0, 255, 0);  /* Green */

            /* Draw rectangle */
            ifx_lcd_draw_Rect(xmin, ymin, xmax, ymax);

            /* Simple text with enrolment feedback */
            if (enrollment_state == ENROLLMENT_STATE_COLLECTING)
            {
#ifdef USE_BIGGER_FONT
                /* Handle different enrolment feedback cases */
                if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_POSE_OUT_OF_RANGE)
                {
                    /* Show pose out of range message */
                    ifx_set_fg_color((255 << 16) | (255 << 8));  /* Yellow text */
                    ifx_set_bg_color(255 << 16); /* Red background*/
                    ifx_print_to_buffer(xtext, ytext - 20, "ADJUST HEAD POSE");
                }
                else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_FACE_AT_BOUNDARY)
                {
                    /* Show face at boundary message */
                    ifx_set_fg_color((255 << 16) | (255 << 8));  /* Yellow text */
                    ifx_set_bg_color(255 << 16);    /* Red background */
                    ifx_print_to_buffer(xtext, ytext - 20, "MOVE AWAY FROM EDGE");
                }
                else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_POSE_REF_LOW_CONF)
                {
                    /* Show pose reference confidence too low message */
                    ifx_set_fg_color((255 << 16) | (255 << 8));  /* Yellow text */
                    ifx_set_bg_color((255 << 16) | (165 << 8));  /* Orange background */
                    ifx_print_to_buffer(xtext, ytext - 20, "IMPROVE POSE QUALITY");
                }
                else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_MULTI_FACE)
                {
                    /* Show multiple faces detected message */
                    ifx_set_fg_color((255 << 16) | (255 << 8) | (255));   /* White text */
                    ifx_set_bg_color(255 << 16);    /* Red background */
                    ifx_print_to_buffer(xtext, ytext - 20, "TOO MANY FACES");
                }
                else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_POSE_COMPLETE)
                {
                    /* Show pose completed message */
                    ifx_set_fg_color(0);         /* Black text */
                    ifx_set_bg_color(255 << 8);  /* Bright green background */
                    ifx_print_to_buffer(xtext, ytext - 20, "POSE COMPLETE!");
                }
                else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_LOW_SIM_MAIN_REF || enrollment_feedback == IFX_FACEID_RSLT_ENROLL_LOW_SIM_POSE_REF)
                {
                    /* Show low similarity message */
                    ifx_set_fg_color((255 << 16) | (255 << 8) | (255));   /* White text */
                    ifx_set_bg_color(128 << 16 | 128); /* Purple background */
                    ifx_print_to_buffer(xtext, ytext - 20, "DIFFERENT PERSON?");
                }
                else
                {
                    /* Normal enrolment message */
                    ifx_set_fg_color((255 << 16) | (255 << 8) | (255));   /* White text */
                    ifx_set_bg_color(128 << 8);      /* Dark green background */
                    ifx_print_to_buffer(xtext, ytext - 20, "ENROLLING...");
                }
                ifx_draw_buffer( renderTarget->memory );
#else
                /* Handle different enrolment feedback cases */
                if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_POSE_OUT_OF_RANGE)
                {
                    /* Show pose out of range message */
                    ifx_lcd_set_FGcolor(255, 255, 0);  /* Yellow text */
                    ifx_lcd_set_BGcolor(255, 0, 0);    /* Red background */
                    ifx_lcd_printfToBuffer(xtext, ytext, "ADJUST HEAD POSE");
                }
                else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_FACE_AT_BOUNDARY)
                {
                    /* Show face at boundary message  */
                    ifx_lcd_set_FGcolor(255, 255, 0);  /* Yellow text */
                    ifx_lcd_set_BGcolor(255, 0, 0);    /* Red background */
                    ifx_lcd_printfToBuffer(xtext, ytext, "MOVE AWAY FROM EDGE");
                }
                else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_POSE_REF_LOW_CONF)
                {
                    /* Show pose reference confidence too low message */
                    ifx_lcd_set_FGcolor(255, 255, 0);  /* Yellow text */
                    ifx_lcd_set_BGcolor(255, 165, 0);  /* Orange background */
                    ifx_lcd_printfToBuffer(xtext, ytext, "IMPROVE POSE QUALITY");
                }
                else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_MULTI_FACE)
                {
                    /* Show multiple faces detected message */
                    ifx_lcd_set_FGcolor(255, 255, 255);  /* White text */
                    ifx_lcd_set_BGcolor(255, 0, 0);      /* Red background */
                    ifx_lcd_printfToBuffer(xtext, ytext, "TOO MANY FACES");
                }
                else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_POSE_COMPLETE)
                {
                    /* Show pose completed message */
                    ifx_lcd_set_FGcolor(0, 0, 0);        /* Black text */
                    ifx_lcd_set_BGcolor(0, 255, 0);      /* Bright green background */
                    ifx_lcd_printfToBuffer(xtext, ytext, "POSE COMPLETE!");
                }
                else if (enrollment_feedback == IFX_FACEID_RSLT_ENROLL_LOW_SIM_MAIN_REF || enrollment_feedback == IFX_FACEID_RSLT_ENROLL_LOW_SIM_POSE_REF)
                {
                    /* Show low similarity message */
                    ifx_lcd_set_FGcolor(255, 255, 255);  /* White text */
                    ifx_lcd_set_BGcolor(128, 0, 128);    /* Purple background */
                    ifx_lcd_printfToBuffer(xtext, ytext, "DIFFERENT PERSON?");
                }
                else
                {
                    /* Normal enrolment message */
                    ifx_lcd_set_FGcolor(255, 255, 255);  /* White text */
                    ifx_lcd_set_BGcolor(0, 128, 0);      /* Dark green background */
                    ifx_lcd_printfToBuffer(xtext, ytext, "ENROLLING...");
                }
#endif /* USE_BIGGER_FONT */
            }
            else
            {
#ifdef USE_BIGGER_FONT
                /* Default enrolment message for other states */
                ifx_set_fg_color((255 << 16) | (255 << 8) | (255));   /* White text */
                ifx_set_bg_color(128 << 8);      /* Dark green background */
                ifx_print_to_buffer(xtext, ytext - 20, "ENROLLING...");
                ifx_draw_buffer( renderTarget->memory );
#else
                /* Default enrolment message for other states */
                ifx_lcd_set_FGcolor(255, 255, 255);  /* White text */
                ifx_lcd_set_BGcolor(0, 128, 0);      /* Dark green background */
                ifx_lcd_printfToBuffer(xtext, ytext, "ENROLLING...");
#endif /* USE_BIGGER_FONT */
            }
        }
        else
        {
            /* INFERENCE MODE: Original colorful styling with user identification */
            cid = (id >= 0) ? (id % 7) + 1 : 0;
            ifx_lcd_set_FGcolor(color_r[cid], color_g[cid], color_b[cid]);
            /* draw rectangle */
            ifx_lcd_draw_Rect(xmin, ymin, xmax, ymax);

#ifdef DRAW_HEAD_POSE_AXES
            /* optional draw of head pose axes (same color as bbox) */
            int16_t tdx = (int16_t)(xmin + ((xmax - xmin) / 2));
            int16_t tdy = (int16_t)(ymin + ((ymax - ymin) / 2));
            ifx_lcd_draw_HeadPoseAxes(tdx, tdy, prediction->yaw[i], prediction->pitch[i], prediction->roll[i]);
#endif /* DRAW_HEAD_POSE_AXES */
#ifdef DRAW_FACIAL_LANDMARKS
            int16_t plot_landmarks[10];
            for (int l=0; l<10; l++){ /* xxxxxyyyyy */
                if (l < 5)
                {
                    /* x */
                    plot_landmarks[l] = (int16_t)(prediction->landmarks[l] * scale_Cam2Disp) + display_offset_x;
                }
                else
                {
                    /* y */
                    plot_landmarks[l] = (int16_t)(prediction->landmarks[l] * scale_Cam2Disp) + display_offset_y;
                }
            }
            ifx_lcd_draw_FacialLandmarks(plot_landmarks);
#endif /*DRAW_FACIAL_LANDMARKS */

#ifdef USE_BIGGER_FONT
            ifx_set_fg_color(((255 - color_r[cid]) << 16) | ((255 - color_g[cid]) << 8) | (255 - color_b[cid]));
#else
            ifx_lcd_set_FGcolor(255 - color_r[cid], 255 - color_g[cid], 255 - color_b[cid]);
#endif /* USE_BIGGER_FONT */

            if (id >= 0)
            {
                if (prediction->is_tracked[i])
                {
                    snprintf(display_name, sizeof(display_name), "*%s*", prediction->class_string[i]); /* indicates it is being tracked */
                }
                else
                {
                    snprintf(display_name, sizeof(display_name), "%s", prediction->class_string[i]);
                }

#ifdef USE_BIGGER_FONT
                ifx_set_bg_color( (color_r[cid] << 16) | (color_g[cid] << 8) | color_b[cid] );
#else
                ifx_lcd_set_BGcolor(color_r[cid], color_g[cid], color_b[cid]);
#endif /* USE_BIGGER_FONT */

                /* only display the class name - without confidence/similarity */
#ifdef USE_BIGGER_FONT
#ifdef PRINT_SCORES
                ifx_print_to_buffer(xtext, ytext - 20, "%s, %.2f %d", display_name, prediction->similarity[i], id);
#else
                ifx_print_to_buffer(xtext, ytext - 20, "%s", display_name);
#endif
                ifx_draw_buffer( renderTarget->memory );
#else
#ifdef PRINT_SCORES
                ifx_lcd_printfToBuffer(xtext, ytext, "%s, %.2f %d", display_name, prediction->similarity[i], id);
#else
                ifx_lcd_printfToBuffer(xtext, ytext, "%s", display_name);
#endif
#endif /* USE_BIGGER_FONT */
            }
            else
            {
#ifdef USE_BIGGER_FONT
                ifx_set_fg_color((255 << 16) | (255 << 8) | 255 ); /* white text */
                ifx_set_bg_color(255 << 16); /* red back-ground */
#ifdef PRINT_SCORES
                ifx_print_to_buffer(xtext, ytext - 20, "Unknown, %.2f", prediction->similarity[i]);
#else
                ifx_print_to_buffer(xtext, ytext - 20, "Unknown");
#endif
                ifx_draw_buffer( renderTarget->memory );
#else
                ifx_lcd_set_FGcolor(COLOR_WHITE, COLOR_WHITE, COLOR_WHITE); /* white text */
                ifx_lcd_set_BGcolor(HEX_RED_BACKGROUND, 0, 0);    /* red back-ground */
#ifdef PRINT_SCORES
                ifx_lcd_printfToBuffer(xtext, ytext, "Unknown, %.2f", prediction->similarity[i]);
#else
                ifx_lcd_printfToBuffer(xtext, ytext, "Unknown");
#endif
#endif /* USE_BIGGER_FONT */
            }
        }

        ifx_lcd_draw_Buffer();
    }

    /* Display database status in top-left area (always visible) */
    display_database_status();

