Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
    /* Display mode indicator - moved down to avoid overlap with database status */
    ifx_lcd_set_FGcolor(255, 255, 0); /* Yellow text */
    ifx_lcd_set_BGcolor(0, 0, 255);   /* Blue background */
    if (current_display_mode == DISPLAY_MODE_INFERENCE)
    {
        ifx_lcd_printf(ALIGN_LEFT, 10, "INFERENCE MODE");
    }
    else
    {
#ifndef DISABLE_ONDEV_ENROLL
        ifx_lcd_printf(ALIGN_LEFT, 10, "ENROLMENT MODE");

        /* If in enrolment mode, show additional enrolment information */
        if (enrollment_type == ENROLLMENT_TYPE_ON_DEVICE)
        {
            /* Get current enrolment progress for display */
            ifx_on_dev_enroll_stats_t enrollment_progress;
            /* we just want status, early return so we can pass in some NULLs */
            ifx_faceid_rslt_t prog_result = ifx_on_device_enrollment(NULL, NULL, ENROLL_MODE_STATUS, &enrollment_progress, enrollment_config);

            if (prog_result == IFX_FACEID_RSLT_SUCCESS)
            {
                update_enrollment_display(prediction, enrollment_config, enrollment_state, enrollment_type, &enrollment_progress, enrollment_feedback);
            }
        }
#endif /* DISABLE_ONDEV_ENROLL */
    }

    /* Display some timing information in bottom-right */
    ifx_lcd_set_FGcolor(0, 255, 0);     /* green text */
    ifx_lcd_set_BGcolor(0, 0, 0);       /* black background */

#ifdef SHOW_INFERENCING_TIME
    ifx_lcd_printf(ALIGN_RIGHT, FPS_TXT_Y_POS, "Model %5.1f ms", model_inferencing_time);
#else
    ifx_lcd_printf(ALIGN_RIGHT, FPS_TXT_Y_POS, "%5.1f Model FPS", fps);
#endif /* SHOW_INFERENCING_TIME */

#ifdef PLOT_ALIGNED_FACES
    if (prediction->count > 0)
    {
        plot_aligned_faces_bottom();
    }
#endif /*PLOT_ALIGNED_FACES */

    /* Show database full overlay if needed (temporary 5-second warning) */
    if (should_show_database_full_overlay())
    {
        display_database_full_overlay();
    }

    __DMB();
}


/********************************************************************************
* Function Name: getInputImage
*********************************************************************************
* Summary:
*  Retrieves and processes an input image from a camera buffer, selecting a valid
*  buffer with fallback logic, performing color format conversions (YUV422 to
*  RGB565, and RGB565 to RGB888), and optionally mirroring the image. Handles
*  timeout and error conditions, clears buffer status after processing, and
*  returns the processed image data for AI inference. Supports test image
*  conversion if enabled.
*
* Parameters:
*  void
*
* Return:
*  uint8_t *: Pointer to the processed RGB888 image buffer, or NULL on error or
*             timeout
*
********************************************************************************/
uint8_t * getInputImage()
{
    vg_lite_error_t error;
    float time_draw_start = get_time_in_ms();
    float current_time = time_draw_start;

    /* **KEY CHANGE**: More robust buffer selection with fallback */
    __DMB();
    uint8_t workBuffer = lastBuffer;
    uint8_t bufReady = 0;

    /* **KEY CHANGE**: Validate buffer index first */
    if (workBuffer >= NUM_IMAGE_BUFFERS)
    {
        printf("[LCD_TASK] Invalid lastBuffer %d, using buffer 0\n", workBuffer);
        workBuffer = 0;
    }

    bufReady = _ImageBuff[workBuffer].BufReady;
    __DMB();

    /* **KEY CHANGE**: If primary buffer not ready, try the other buffer */
    if (bufReady == 0)
    {
        uint8_t altBuffer = (workBuffer + 1) % NUM_IMAGE_BUFFERS;
        __DMB();
        if (_ImageBuff[altBuffer].BufReady == 1) {
            workBuffer = altBuffer;
            bufReady = 1;
            printf("[LCD_TASK] Primary buffer %d not ready, using buffer %d\n", lastBuffer, workBuffer);
        }
        __DMB();
    }

    /* Simple timeout without aggressive recovery */
    if (bufReady == 0)
    {
        if (last_successful_frame_time == 0)
        {
            last_successful_frame_time = current_time;
        }

        float time_since_last_frame = current_time - last_successful_frame_time;

        if (time_since_last_frame > watchdog_timeout)
        {
            if (recovery_attempts == 0)
            {
                printf("[LCD_TASK][TIMEOUT] No frames for %.1f seconds\n", time_since_last_frame / 1000.0f);
                recovery_attempts = 1;
            }
        }
        return NULL;
    }

    /* Success path - frame available */
    if (recovery_attempts > 0)
    {
        printf("[LCD_TASK][RECOVERY] Frame received after timeout\n");
        recovery_attempts = 0;
    }
    last_successful_frame_time = current_time;

    /* Validate buffer data before processing */
    __DMB();
    if (_ImageBuff[workBuffer].NumBytes != CAMERA_BUFFER_SIZE)
    {
        /* Clear the bad buffer */
        _ImageBuff[workBuffer].NumBytes = 0;
        __DMB();
        _ImageBuff[workBuffer].BufReady = 0;
        __DMB();
        return NULL;
    }

    /* Process the frame */
    float time_draw_1 = get_time_in_ms();
    error = vg_lite_blit(&bgr565, &usb_yuv_frames[workBuffer], NULL,
            VG_LITE_BLEND_NONE, 0, VG_LITE_FILTER_POINT);
    if (error) {
        printf("\r\n[LCD_TASK][ERROR] vg_lite_blit() error %d\r\n", error);

        /* **KEY CHANGE**: Clear buffer even on error to prevent stuck state */
        _ImageBuff[workBuffer].NumBytes = 0;
        __DMB();
        _ImageBuff[workBuffer].BufReady = 0;
        __DMB();

        cleanup();
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }
    vg_lite_flush();
    vg_lite_finish();

#ifndef ENABLE_WEB_STREAMING
    /* **KEY CHANGE**: Clear buffer status AFTER successful processing */
    /* Use more robust atomic clearing */
    _ImageBuff[workBuffer].NumBytes = 0;
    __DMB();
    _ImageBuff[workBuffer].BufReady = 0;
    __DMB();
#endif

    if (!point3mp_camera_enabled){
        mirrorImage(&bgr565);
    }

    /* display 320x240 BGR565 image on LCD (scaled display BGR565) */
    float time_draw_3 = get_time_in_ms();
#ifdef USE_KIT_PSE84_HMI
    /* Rotate 90 CW so the AI model receives correctly oriented image.
    * After rotation: width = CAMERA_HEIGHT, height = CAMERA_WIDTH */
    rotate_frame(bgr565.memory, Image_buf_bgr565_rotated);
    ifx_image_conv_RGB565_to_RGB888(Image_buf_bgr565_rotated, CAMERA_HEIGHT, CAMERA_WIDTH,
            Image_buf_bgr888, IMAGE_WIDTH, IMAGE_HEIGHT);
#else
    ifx_image_conv_RGB565_to_RGB888(bgr565.memory, CAMERA_WIDTH, CAMERA_HEIGHT,
            Image_buf_bgr888, IMAGE_WIDTH, IMAGE_HEIGHT);
#endif /* USE_KIT_PSE84_HMI */

    float time_draw_end = get_time_in_ms();

#ifdef ENABLE_WEB_STREAMING
    /* CHUNKED STREAMING: Quick push of frame (JPEG encodes immediately, no race)
    * Only JPEG encoding happens here (~30ms), then UART task sends chunks
    * No race condition because we compress entire frame before returning */
    extern bool chunked_stream_is_active(void);
    extern bool chunked_stream_push_frame(const uint16_t *rgb565);
    if (chunked_stream_is_active())
    {
        chunked_stream_push_frame((uint16_t*)bgr565.memory);
    }

    /* Clear buffer status AFTER frame captured for streaming */
    /* This signals camera that it can write the next frame */
    _ImageBuff[workBuffer].NumBytes = 0;
    __DMB();
    _ImageBuff[workBuffer].BufReady = 0;
    __DMB();
#endif

    /* Performance measurements */
    Time_getInputImage      = time_draw_end - time_draw_start;
    Prep_Wait_Buf           = time_draw_1   - time_draw_start;
    Prep_YUV422_to_bgr565   = time_draw_3   - time_draw_1;
    Prep_RGB565_to_RGB888   = time_draw_end - time_draw_3;

#ifdef TEST_SAVED_IMAGE

