Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
    /* Convert test image (RGB888) to BGR565 for display */
    ifx_image_conv_RGB888_to_RGB565(one_detection, ONE_DETECTION_WIDTH, ONE_DETECTION_HEIGHT,
            bgr565.memory, CAMERA_WIDTH, CAMERA_HEIGHT);

    /* Copy test image to RGB888 for AI inference */
    /* Make sure sizes match: both should be IMAGE_WIDTH * IMAGE_HEIGHT * 3 */
    size_t copy_size = min(ONE_DETECTION_SIZE, sizeof(Image_buf_bgr888));
    memcpy(Image_buf_bgr888, one_detection, copy_size);

#endif /* TEST_SAVED_IMAGE */

    return Image_buf_bgr888;
}


/********************************************************************************
* Function Name: VG_LITE_ERROR_EXIT
*********************************************************************************
* Summary:
*  Handles vector graphics library errors by printing an error message with the
*  specified status, performing cleanup, and triggering an assertion to halt
*  execution.
*
* Parameters:
*  char *msg: Error message to be printed
*  vg_lite_error_t vglite_status: Vector graphics library error status code

* Return:
*  void
*
********************************************************************************/
void VG_LITE_ERROR_EXIT(char *msg, vg_lite_error_t vglite_status)
{
    printf("[LCD_TASK][ERROR] %s %d\r\n", msg, vglite_status);
    cleanup();
    CY_ASSERT(0);
}


/********************************************************************************
* Function Name: VG_switch_frame
*********************************************************************************
* Summary:
*  Switches the display frame buffer by setting the new frame buffer address in
*  the graphics subsystem, transferring it to the display controller, and swapping
*  between double-buffered render targets.
*
* Parameters:
*  void
*
* Return:
*  void
*
********************************************************************************/
void VG_switch_frame()
{
    static int    _current_buffer = 0;

    vg_lite_flush();
    vg_lite_finish();

    /* Sets Video/Graphics layer buffer address and transfer the frame buffer to DC */
    Cy_GFXSS_Set_FrameBuffer(base, (uint32_t*) renderTarget->address, &gfx_context);
    __DMB();

    /* Swap buffers */
    _current_buffer ^= 1;
    renderTarget = &display_buffer[_current_buffer];

    __DMB();
}


/********************************************************************************
* Function Name: cm55_ns_gfx_task
*********************************************************************************
* Summary:
*  Main graphics task for the CM55 non-secure domain, responsible for initializing
*  the graphics subsystem, display, touch input, and face ID library. Continuously
*  processes camera images, performs face detection and enrolment, updates the
*  LCD display based on the current mode (inference or enrolment), and handles
*  touch button events for enrolment control. Manages buffer states, database
*  operations, and error handling.
*
* Parameters:
*  void *arg: Task argument
*
* Return:
*  void
*
********************************************************************************/
void cm55_ns_gfx_task(void *arg)
{
    CY_UNUSED_PARAMETER(arg);
    ifx_faceid_rslt_t   ifx_result = IFX_FACEID_RSLT_SUCCESS;
    ifx_faceid_rslt_t db_update_result;

    cy_en_gfx_status_t  status = CY_GFX_SUCCESS;
    cy_en_sysint_status_t sysint_status = CY_SYSINT_SUCCESS;
    vg_lite_error_t     vglite_status = VG_LITE_SUCCESS;

    uint8_t *image_buf = NULL;

    /* initialize the detection options and output structs */
    ifx_faceid_prediction_t prediction;
    ifx_faceid_opt_t opt = {
            .image_width    = IMAGE_WIDTH,  /* input buffer width (320) */
            .image_height   = IMAGE_HEIGHT, /* input buffer height (240) */
            .scaled_width   = 0,            /* will get set on init of model */
            .scaled_height  = 0             /* will get set on init of model */
    };

    /* Display mode tracking */
    display_mode_t current_display_mode = DISPLAY_MODE_INFERENCE;

    float time_model_start = 0.0f;
    float time_model_end = 0.0f;

    #if defined(USE_KIT_PSE84_HMI)
    /* clear the stale pixel data */
    memset((void *)contiguous_mem, 0, FRAME_BUFFER_SIZE * 2U);
    #endif

    /* Set frame buffer address to the GFXSS configuration structure */
    GFXSS_config.dc_cfg->gfx_layer_config->buffer_address    = (gctADDRESS *) vglite_heap_base;
    GFXSS_config.dc_cfg->gfx_layer_config->uv_buffer_address = (gctADDRESS *) vglite_heap_base;

    /* Initializes the graphics subsystem according to the configuration */
    status = Cy_GFXSS_Init(base, &GFXSS_config, &gfx_context);
    if (CY_GFX_SUCCESS != status)
    {
        printf("[LCD_TASK][ERROR] Graphics subsystem initialization failed: Cy_GFXSS_Init() returned error %d\r\n", status);
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }

    /* Initialize GFXXs DC interrupt */
    sysint_status = Cy_SysInt_Init(&dc_irq_cfg, dc_irq_handler);
    if (CY_SYSINT_SUCCESS != sysint_status)
    {
        printf("[LCD_TASK][ERROR] Error in registering DC interrupt: %d\r\n", sysint_status);
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }
    NVIC_EnableIRQ(GFXSS_DC_IRQ);        /* Enable interrupt in NVIC. */
    Cy_GFXSS_Clear_DC_Interrupt(base, &gfx_context);

    /* Initialize GFX GPU interrupt */
    sysint_status = Cy_SysInt_Init(&gpu_irq_cfg, gpu_irq_handler);
    if (CY_SYSINT_SUCCESS != sysint_status)
    {
        printf("[LCD_TASK][ERROR] Error in registering GPU interrupt: %d\r\n", sysint_status);
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }

    /* Enable GPU interrupt */
    Cy_GFXSS_Enable_GPU_Interrupt(base);
    NVIC_EnableIRQ(GFXSS_GPU_IRQ);        /* Enable GPU interrupt in NVIC. */

    #if defined(USE_KIT_PSE84_HMI)
    cy_rslt_t result;
    /* Set initial brightness level to 100% */
    uint8_t brightness_level = 100; 

    result = mtb_display_st7701s_init(GFXSS_GFXSS_MIPIDSI, &st7701s_backlight_cfg);

    if (CY_RSLT_SUCCESS != result)
    {
        printf("ST7701S 4-Inch display init failed with status = %u\r\n", (unsigned int) result);
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }

