Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
    mtb_display_st7701s_set_brightness(brightness_level);

    #else
    cy_en_scb_i2c_status_t i2c_result = CY_SCB_I2C_SUCCESS;

    /* Initialize the I2C in controller mode. */
    i2c_result = Cy_SCB_I2C_Init(DISPLAY_I2C_CONTROLLER_HW,
            &DISPLAY_I2C_CONTROLLER_config, &disp_i2c_controller_context);

    if (CY_SCB_I2C_SUCCESS != i2c_result)
    {
        printf("I2C controller initialization failed !!\r\n");
#ifndef ENABLE_WEB_STREAMING
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
#endif
    }
    /* Initialize the I2C interrupt */
    sysint_status = Cy_SysInt_Init(&i2c_controller_irq_cfg,
            &i2c_controller_interrupt);

    if (CY_SYSINT_SUCCESS != sysint_status)
    {
        printf("I2C controller interrupt initialization failed\r\n");
#ifndef ENABLE_WEB_STREAMING
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
#endif
    }
    /* Enable the I2C interrupts. */
    NVIC_EnableIRQ(i2c_controller_irq_cfg.intrSrc);

    /* Enable the I2C */
    Cy_SCB_I2C_Enable(DISPLAY_I2C_CONTROLLER_HW);

    /* Allow I2C to be stabalized to initialize the display */
    Cy_SysLib_Delay(I2C_DELAY_MS);

    i2c_result = mtb_disp_waveshare_4p3_init(DISPLAY_I2C_CONTROLLER_HW,
            &disp_i2c_controller_context);

    if (CY_SCB_I2C_SUCCESS != i2c_result)
    {
        printf("Waveshare 4.3-Inch display init failed with status = %u\r\n", (unsigned int) i2c_result);
#ifndef ENABLE_WEB_STREAMING
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
#endif
    }
    #endif

    /* Set the display size for LCD utils */
    ifx_lcd_set_Display_size(DISPLAY_W, DISPLAY_H);
    /***************************************************************/
    /* Init VGLite */
    vg_module_parameters_t vg_params;
    vg_params.register_mem_base = (uint32_t) GFXSS_GFXSS_GPU_GCNANO;
    vg_params.gpu_mem_base[VG_PARAMS_POS] = GPU_MEM_BASE;
    vg_params.contiguous_mem_base[VG_PARAMS_POS] = vglite_heap_base;
    vg_params.contiguous_mem_size[VG_PARAMS_POS] = VGLITE_HEAP_SIZE;

    vg_lite_init_mem(&vg_params);

    /* Initialize the draw */

    vglite_status = vg_lite_init(256, 256);
    if (VG_LITE_SUCCESS != vglite_status)
    {
        VG_LITE_ERROR_EXIT("vg_lite engine init failed: vg_lite_init() returned error %d\r\n", vglite_status);
    }

    /* setup double display-frame-buffers */
    for (int ii = 0; ii < 2; ii++)
    {
        display_buffer[ii].width  = DISPLAY_W;
        display_buffer[ii].height = DISPLAY_H;
        display_buffer[ii].format = VG_LITE_BGR565;
        vglite_status = vg_lite_allocate(&display_buffer[ii]);
        if (VG_LITE_SUCCESS != vglite_status) {
            VG_LITE_ERROR_EXIT("display_buffer[] allocation failed in vglite space: vg_lite_allocate() returned error %d\r\n", vglite_status);
        }
    }
    renderTarget = &display_buffer[0];

    /* Allocate the camera buffers */
    for (int i = 0; i < NUM_IMAGE_BUFFERS; i++)
    {
        usb_yuv_frames[i].width  = CAMERA_WIDTH;
        usb_yuv_frames[i].height = CAMERA_HEIGHT;
        usb_yuv_frames[i].format = VG_LITE_YUYV;
        usb_yuv_frames[i].image_mode = VG_LITE_NORMAL_IMAGE_MODE;
        vglite_status = vg_lite_allocate(&usb_yuv_frames[i]);
        if (VG_LITE_SUCCESS != vglite_status)
        {
            VG_LITE_ERROR_EXIT("camera buffers allocation failed in vglite space: vg_lite_allocate() returned error %d\r\n", vglite_status);
        }
    }

    /* Allocate the work camera buffer */
    bgr565.width  = CAMERA_WIDTH;
    bgr565.height = CAMERA_HEIGHT;
    bgr565.format = VG_LITE_BGR565;
    bgr565.image_mode = VG_LITE_NORMAL_IMAGE_MODE;
    bgr565.stride = CAMERA_WIDTH * 2;
    bgr565.handle = 0;
    bgr565.memory = (void *)Image_buf_bgr565;
    bgr565.address = (uint32_t)Image_buf_bgr565;

    /* Clear the buffer with Black */
    vglite_status = vg_lite_clear(renderTarget, NULL, BLACK_COLOR);
    if (VG_LITE_SUCCESS != vglite_status)
    {
        VG_LITE_ERROR_EXIT("Clear failed: vg_lite_clear() returned error %d\r\n", vglite_status);
    }

    /***************************************************************/

    /* Define the transformation matrix that will be applied from the camera image to the display */
    vg_lite_identity(&matrix);

    /* scale factor from the camera image to the display */
    float scale_Cam2Disp_x = (float)DISPLAY_W / (float)CAMERA_WIDTH;
    float scale_Cam2Disp_y = (float)DISPLAY_H / (float)CAMERA_HEIGHT;
    /* this decides if you want to display the whole image and add boundaries (min),
    or display with no boundaries but crop off some of the image (camera vs display aspect ratio mismatch handling) */

    scale_Cam2Disp = max(scale_Cam2Disp_x, scale_Cam2Disp_y);  /* 4.3" uses max to fill screen */

    vg_lite_scale(scale_Cam2Disp, scale_Cam2Disp, &matrix);

    /* Move the scaled-frame to the display center */
    float translate_x = (DISPLAY_W / scale_Cam2Disp - CAMERA_WIDTH) * 0.5f;
    float translate_y = (DISPLAY_H / scale_Cam2Disp - CAMERA_HEIGHT) * 0.5f;

    /* Move the scaled image buffer frame to the display center */
    display_offset_x = (DISPLAY_W - scale_Cam2Disp * IMAGE_WIDTH) / 2;
    display_offset_y = (DISPLAY_H - scale_Cam2Disp * CAMERA_HEIGHT) / 2;

    vg_lite_translate(translate_x, translate_y, &matrix);

#ifdef USE_KIT_PSE84_HMI
    /* Override matrix: define the rotation matrix (90 degrees) and apply vertical flip */
    vg_lite_identity(&matrix);
    vg_lite_translate(ROTATE_MATRIX_X, ROTATE_MATRIX_Y, &matrix);
    vg_lite_rotate(ROTATE_ANGLE, &matrix);
    vg_lite_scale(FLIP_MATRIX_X, FLIP_MATRIX_Y, &matrix);
    vg_lite_translate(-ROTATE_MATRIX_X, -ROTATE_MATRIX_Y, &matrix);
    vg_lite_scale(scale_Cam2Disp, scale_Cam2Disp, &matrix);
#endif /* USE_KIT_PSE84_HMI */

    touch_input_dev_init();

    for (uint8_t i = 0; i < BUTTON_ID_MAX; i++)
    {
        touch_button_event[i].event = TOUCH_BUTTON_EVENT_RELEASED;
        touch_button_event[i].pressed = false;
        touch_button_event[i].released = false;
    }

    /* Initialize RRAM for NVM */
    cy_en_rram_status_t rram_status = Cy_RRAM_TSReadByteArray(RRAMC0,
            (uint32_t) &enrolled_user_faceid_embeddings,
            (uint8_t *) &faceid_embeddings,
            sizeof(enrolled_user_faceid_embeddings));

    if (CY_RRAM_SUCCESS != rram_status)
    {
        printf("[ERROR] Failed to read enrolled user data from NVM database\r\n");
    }

    /* Configure enrolment parameters (set to defaults for now, but change for threshold tuning) */
    printf("[LCD_TASK] Configuring enrolment parameters...\n");
    ifx_enrollment_config_t enrollment_config = {0};
    /* Get current defaults first */
    ifx_result = ifx_face_id_get_enrollment_config(&enrollment_config);
    if (ifx_result != IFX_FACEID_RSLT_SUCCESS)
    {
        printf("[LCD_TASK][ERROR] Failed to get enrolment config: %d\n", ifx_result);
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }
    /* For now, just set num_poses based on your cm55's Makefile NUM_POSES arg */
    enrollment_config.num_poses = NUM_POSES;

    /* Configure inference parameters (set to defaults for now, but change for threshold tuning) */
    printf("[LCD_TASK] Configuring inference parameters...\n");
    ifx_inference_config_t inference_config = {0};
    /* Get current defaults first */
    ifx_result = ifx_face_id_get_inference_config(&inference_config);
    if (ifx_result == IFX_FACEID_RSLT_SUCCESS)
    {
        if(Logitech_camera_enabled == 0){
            /* if we are using the WPP webcam (0.3 MP instead of the C920e 5 MP), we need to handle more noise and blur etc */
            /* lets tune some thresholds here to make our life a bit easier when using it */
            /* the main issue I notice is that it misses more faces at detect, so lets start by just tuning those thresholds */
            inference_config.thresh_kp_conf = 0.7;/* was previously 0.8 by default. Increase if you notice non-face detected boxes */
            inference_config.thresh_det_conf = 0.275;   /* was previously 0.375 by default. Increase if you notice non-face detected boxes */
            inference_config.default_face_id_sim_th = 0.5; /* was previously 0.5, need it to be stricter */
        }
    }
    else
    {
        printf("[LCD_TASK][ERROR] Failed to get inference config: %d\n", ifx_result);
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }

    /* Initialize faceID library */
    ifx_result = ifx_face_id_init(&opt, &prediction, &faceid_embeddings, &inference_config, &enrollment_config);
    if (IFX_FACEID_RSLT_SUCCESS != ifx_result)
    {
        printf("\r\n[LCD_TASK][ERROR] ifx_face_id_init: fail\r\n\n");
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }

    /* check the display values in the design.modus generated config source code match the desired build values */
    uint16_t desired_display_h, desired_display_w;
    desired_display_h = DISPLAY_H;
    desired_display_w = DISPLAY_W;

    bool display_error = true;
    if (GFXSS_dc_config.display_width != desired_display_w)
    {
        printf("\n[LCD_ERROR] GFXSS_dc_config.display_width = %" PRIu32 "\n", GFXSS_dc_config.display_width);
    }
    else if (GFXSS_dc_config.display_height != desired_display_h) {
        printf("\n[LCD_ERROR] GFXSS_dc_config.display_height = %" PRIu32 "\n", GFXSS_dc_config.display_height);
    }
    else if (GFXSS_dc_config.gfx_layer_config->width != desired_display_w)
    {
        printf("\n[LCD_ERROR] GFXSS_dc_config.gfx_layer_config.width = %d\n", GFXSS_dc_config.gfx_layer_config->width);
    }
    else if (GFXSS_dc_config.gfx_layer_config->height != desired_display_h)
    {
        printf("\n[LCD_ERROR] GFXSS_dc_config.gfx_layer_config.height = %d\n", GFXSS_dc_config.gfx_layer_config->height);
    }
    else if (GFXSS_mipidsi_display_params.hdisplay != desired_display_w)
    {
        printf("\n[LCD_ERROR] GFXSS_mipidsi_display_params.hdisplay = %d\n", GFXSS_mipidsi_display_params.hdisplay);
    }
    else if (GFXSS_mipidsi_display_params.vdisplay != desired_display_h)
    {
        printf("\n[LCD_ERROR] GFXSS_mipidsi_display_params.vdisplay = %d\n", GFXSS_mipidsi_display_params.vdisplay);
    }
    else
    {
        display_error = false; /* all is good if it reaches else */
    }
    if (display_error == true)
    {
        printf("\nPlease adjust your design.modus as appropraite for your selected build option display.\r\n");
        CY_ASSERT(NUM_CY_ASSERT_VALUE);
    }

    /* Initialize buffer states - clear any startup artifacts */
    printf("[LCD_TASK] Clearing all buffers at startup\n");
    for (int i = 0; i < NUM_IMAGE_BUFFERS; i++)
    {
        _ImageBuff[i].BufReady = 0;
        _ImageBuff[i].NumBytes = 0;
    }
    __DMB();

    init_buffer_system();

    /* Initialize database user count */
    printf("[LCD_TASK] Initializing database user count...\n");
    ifx_faceid_rslt_t db_result = update_database_user_count();
    if (db_result != IFX_FACEID_RSLT_SUCCESS)
    {
        printf("[LCD_TASK][WARNING] Failed to initialize database user count: %d\n", db_result);
    }
    else
    {
        printf("[LCD_TASK] Database initialized with %d users\n", current_user_count);
    }

    ifx_faceid_rslt_t current_enrollment_feedback = IFX_FACEID_RSLT_SUCCESS;

    /* Delay for USB enumeration to complete before rendering
    * data to the display
    */
    vTaskDelay(pdMS_TO_TICKS(1200));

    printf("[LCD_TASK] Starting while loop for model inference ...\n");

    while (1)
    {
        if (_device_connected)
        {
            /* get the latest input image to the input image buffer (image_buf_int8) */
            image_buf = getInputImage();
            if (image_buf == NULL)
            {
                vTaskDelay(pdMS_TO_TICKS(10)); /* Needed to avoid race condition */
                continue;
            }

#ifdef ENABLE_WEB_STREAMING
            /* When UART streaming: Run Face ID but skip LCD rendering to maximize FPS
            * Face ID inference: ~25-30ms (fast enough)
            * LCD rendering: ~50-100ms (V-sync bottleneck)
            * This gives best of both worlds: face recognition + high FPS streaming
            * NOTE: Frame capture now happens inside getInputImage() BEFORE buffer is cleared */
            bool is_uart_streaming = chunked_stream_is_active();

#endif

