Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
            /* Update database user count every frame (lightweight operation) */
            db_update_result = update_database_user_count();
            if (db_update_result != IFX_FACEID_RSLT_SUCCESS) {
                printf("[LCD_TASK][WARNING] Failed to update database user count: %d\n", db_update_result);
            }

            /* we want to enable augmentation when collecting data (after reference acquired) */
            bool augment = enrollment_state == ENROLLMENT_STATE_COLLECTING;
            time_model_start = ifx_time_get_ms_f(); /* start timer for when Face ID model system starts to execute */

            /* Inference */
            ifx_result = ifx_face_id_inference(
                    image_buf,
                    &opt,
                    &prediction,
                    &faceid_embeddings,
                    augment,
                    &inference_config);

            if (ifx_result != IFX_FACEID_RSLT_SUCCESS)
            {
                printf("[LCD_TASK][ERROR] Face inference failed with error: %u\n", ifx_result);
            }
            else if (enrollment_type == ENROLLMENT_TYPE_ON_DEVICE)
            {
                /* Process on-device enrolment states */
                ifx_on_dev_enroll_stats_t progress;
                ifx_faceid_rslt_t enroll_result = IFX_FACEID_RSLT_SUCCESS;

                if (enrollment_state == ENROLLMENT_STATE_WAITING_FOR_REFERENCE)
                {
                    /* Try to capture reference image using init mode */
                    enroll_result = ifx_on_device_enrollment(&prediction, &opt, ENROLL_MODE_INIT, &progress, &enrollment_config);
                    current_enrollment_feedback = enroll_result;  /* Store feedback */
                    if (enroll_result == IFX_FACEID_RSLT_SUCCESS)
                    {
                        /* Reference captured successfully */
                        printf("[LCD_TASK] Reference face acquired, now collecting poses\n");
                        enrollment_state = ENROLLMENT_STATE_COLLECTING;
#ifdef ENABLE_WEB_STREAMING
                        /* Send progress update via UART */
                        if (chunked_stream_is_active())
                        {
                            char user_name[20];
                            snprintf(user_name, sizeof(user_name), "User_%d", current_user_count);

                            /* Calculate current pose based on actual face orientation */
                            uint8_t current_pose = 0;
                            if (prediction.count == 1)
                            {
                                int pose_idx = ifx_face_id_get_pose_bin_index(&enrollment_config, prediction.yaw[0], prediction.pitch[0], prediction.roll[0]);
                                printf("[ENROLL_REF] Yaw=%.1f, Pitch=%.1f, Roll=%.1f -> Pose=%d\n",
                                    (double)prediction.yaw[0], (double)prediction.pitch[0], (double)prediction.roll[0], pose_idx);
                                if ((uint32_t)pose_idx < (uint32_t)progress.num_poses) {
                                    current_pose = (uint8_t)pose_idx;
                                }
                            }
                            else
                            {
                                /* If no valid face detected, find first in-progress pose */
                                for (int i = 0; i < progress.num_poses; i++)
                                {
                                    if (progress.enroll_progress[i] == PROGRESS_IN_PROGRESS)
                                    {
                                        current_pose = i;
                                        break;
                                    }
                                }
                            }

                            /* Calculate overall progress percentage */
                            uint8_t completed = 0;
                            for (int i = 0; i < progress.num_poses; i++)
                            {
                                if (progress.enroll_progress[i] == PROGRESS_COMPLETED) completed++;
                            }
                            uint8_t progress_percent = (completed * 100) / progress.num_poses;

                            /* Convert progress enum to percentages */
                            uint8_t pose_progress[MAX_ENROLLMENT_POSES] = {0};
                            for (int i = 0; i < progress.num_poses && i < MAX_ENROLLMENT_POSES; i++)
                            {
                                pose_progress[i] = (progress.enroll_progress[i] == PROGRESS_COMPLETED) ? 100 :
                                                (progress.enroll_progress[i] == PROGRESS_IN_PROGRESS) ? 50 : 0;
                            }

                            chunked_stream_push_enrollment_progress(2, current_pose, progress.num_poses,
                                                                progress_percent, pose_progress, user_name);
                        }
#endif
                    }
                    else if (enroll_result != IFX_FACEID_RSLT_ENROLL_WAITING)
                    {
                        /* Error occurred */
                        printf("[LCD_TASK][ERROR] Failed to initialize enrolment\n");
                        enrollment_state = ENROLLMENT_STATE_NONE;
                        enrollment_type = ENROLLMENT_TYPE_NONE;
                        current_display_mode = DISPLAY_MODE_INFERENCE;
                    }
                    /* If enroll_result == IFX_FACEID_RSLT_ENROLL_WAITING, keep waiting for reference */
                }
                else if (enrollment_state == ENROLLMENT_STATE_COLLECTING)
                {
                    /* Automatically update enrolment with the current face data */
                    enroll_result = ifx_on_device_enrollment(&prediction, &opt, ENROLL_MODE_UPDATE, &progress, &enrollment_config);

#ifdef ENABLE_WEB_STREAMING
                    /* Send periodic progress updates (throttled to every ~3 frames for responsive UI) */
                    static uint32_t enroll_update_count = 0;
                    if (chunked_stream_is_active() && (++enroll_update_count % 3) == 0)
                    {
                        char user_name[20];
                        snprintf(user_name, sizeof(user_name), "User_%d", current_user_count);

                        /* Calculate current pose based on actual face orientation */
                        uint8_t current_pose = 0;
                        if (prediction.count == 1)
                        {
                            int pose_idx = ifx_face_id_get_pose_bin_index(&enrollment_config, prediction.yaw[0], prediction.pitch[0], prediction.roll[0]);
                            printf("[ENROLL] Yaw=%.1f, Pitch=%.1f, Roll=%.1f -> Pose=%d\n",
                                (double)prediction.yaw[0], (double)prediction.pitch[0], (double)prediction.roll[0], pose_idx);
                            if ((uint32_t)pose_idx < (uint32_t)progress.num_poses)
                            {
                                current_pose = (uint8_t)pose_idx;
                            }
                        }
                        else
                        {
                            /* If no valid face detected, find first incomplete pose */
                            for (int i = 0; i < progress.num_poses; i++)
                            {
                                if (progress.enroll_progress[i] != PROGRESS_COMPLETED)
                                {
                                    current_pose = i;
                                    break;
                                }
                            }
                        }

