Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
                        /* Calculate overall progress percentage */
                        uint8_t completed = 0;
                        for (int i = 0; i < progress.num_poses; i++)
                        {
                            if (progress.enroll_progress[i] == PROGRESS_COMPLETED) completed++;
                        }
                        uint8_t progress_percent = (completed * 100) / progress.num_poses;

                        /* Convert progress enum to percentages */
                        uint8_t pose_progress[MAX_ENROLLMENT_POSES] = {0};
                        for (int i = 0; i < progress.num_poses && i < MAX_ENROLLMENT_POSES; i++)
                        {
                            pose_progress[i] = (progress.enroll_progress[i] == PROGRESS_COMPLETED) ? 100 :
                                            (progress.enroll_progress[i] == PROGRESS_IN_PROGRESS) ? 50 : 0;
                        }

                        chunked_stream_push_enrollment_progress(2, current_pose, progress.num_poses,
                                                            progress_percent, pose_progress, user_name);
                    }
#endif
                    current_enrollment_feedback = enroll_result;  /* Store feedback */
                    /* Check if all poses are completed and auto-complete enrolment */
                    if (is_enrollment_complete(&progress))
                    {
                        enrollment_state = ENROLLMENT_STATE_COMPLETING;
                        /* Complete the enrolment process and add user to database */
                        ifx_result = ifx_complete_on_device_enrollment(&faceid_embeddings, &enrollment_config, &inference_config);
                        if (ifx_result == IFX_FACEID_RSLT_SUCCESS)
                        {
                            printf("[LCD_TASK] On-device enrolment completed automatically!\n");

                            if (CY_RRAM_SUCCESS != ifx_copy_embeddings_to_nvm((uint32_t) &enrolled_user_faceid_embeddings,
                                    (uint8_t *) &faceid_embeddings,
                                    sizeof(faceid_embeddings)))
                            {
                                printf("[LCD_TASK][ERROR] Failed to add enrolled user data to the NVM database\r\n");
                            }
                            else
                            {
                                printf("[LCD_TASK] Added enrolled user data to the NVM database successfully!\r\n");

                                touch_button_event[FACE_ENROL_BUTTON_ID].event = TOUCH_BUTTON_EVENT_RELEASED;
                                touch_button_event[FACE_ENROL_BUTTON_ID].pressed = false;

                            }

                            /* Update user count after successful enrolment */
                            db_update_result = update_database_user_count();
                            if (db_update_result != IFX_FACEID_RSLT_SUCCESS)
                            {
                                printf("[LCD_TASK][WARNING] Failed to update user count after enrolment: %d\n", db_update_result);
                            }

#ifdef ENABLE_WEB_STREAMING
                            /* Send completion notification via UART (state=4 for completed) */
                            char user_name[20];
                            snprintf(user_name, sizeof(user_name), "User_%d", current_user_count - 1);  /* -1 because count was just incremented */
                            chunked_stream_push_enrollment_progress(4, progress.num_poses, progress.num_poses,
                                                                100, progress.enroll_progress, user_name);
#endif
                        }
                        else if (ifx_result == IFX_FACEID_RSLT_DB_FULL)
                        {
                            printf("[LCD_TASK][ERROR] Database is full - cannot auto-complete enrolment\n");
                            trigger_database_full_overlay(); /* Show overlay warning */

                            /* Call the abort function to clean up */
                            ifx_result = ifx_abort_on_device_enrollment(&enrollment_config);
                            if (ifx_result != IFX_FACEID_RSLT_SUCCESS) {
                                printf("[LCD_TASK][ERROR] Failed to properly abort enrolment\n");
                            }
                        }
                        else
                        {
                            printf("[LCD_TASK][ERROR] Failed to complete auto-enrolment\n");
                        }
                        /* Reset enrolment state */
                        enrollment_state = ENROLLMENT_STATE_NONE;
                        enrollment_type = ENROLLMENT_TYPE_NONE;
                        current_display_mode = DISPLAY_MODE_INFERENCE;
                    }
                    if (enroll_result != IFX_FACEID_RSLT_SUCCESS) {
                        /* Handle serious errors if needed */
                    }
                }

                /* Use progress data to update display */
                update_enrollment_display(&prediction, &enrollment_config, enrollment_state, enrollment_type, &progress, enroll_result);
            }

#ifdef ENABLE_FACEID_MODEL_PROFILE
            ifx_face_id_print_profiling_info();
#endif /* ENABLE_FACEID_MODEL_PROFILE */


            /* Clear button handler */
            if (touch_button_event[CLEAR_ENROL_BUTTON_ID].pressed || fid_home_clear_enrolled_users_flag)

            {

                touch_button_event[CLEAR_ENROL_BUTTON_ID].pressed = false;

                fid_home_clear_enrolled_users_flag = false;
                printf("Clearing all enrolled users from database\n");
                /* Clear the user database */
                ifx_result = ifx_face_id_clear_all_enrolled_users(&faceid_embeddings, &inference_config);
                if (ifx_result == IFX_FACEID_RSLT_SUCCESS)
                {
                    printf("\n[LCD_TASK] Successfully cleared all enrolled users from the database\n");


                    if (CY_RRAM_SUCCESS != ifx_copy_embeddings_to_nvm((uint32_t) &enrolled_user_faceid_embeddings, (uint8_t *) &faceid_embeddings, sizeof(faceid_embeddings)))
                    {
                        printf("[LCD_TASK][ERROR] Failed to clear enrolled user data from the NVM database\r\n");
                    }
                    else
                    {
                        printf("[LCD_TASK] Successfully cleared all enrolled users from the NVM database\r\n");
                    }

                    /* Update user count after clearing */
                    db_update_result = update_database_user_count();
                    if (db_update_result != IFX_FACEID_RSLT_SUCCESS)
                    {
                        printf("[LCD_TASK][WARNING] Failed to update user count after clearing: %d\n", db_update_result);
                    }
                }
                else
                {
                    printf("\n[LCD_TASK][ERROR] Failed to clear enrolled users database\n");
                }
            }


            /* Cancel button handler */
            if (touch_button_event[CANCEL_ENROL_BUTTON_ID].pressed || fid_home_cancel_enrollment_flag)

            {
                fid_home_cancel_enrollment_flag = false;

                touch_button_event[CANCEL_ENROL_BUTTON_ID].pressed = false;
                if (TOUCH_BUTTON_EVENT_PRESSED == touch_button_event[FACE_ENROL_BUTTON_ID].event)
                {
                    touch_button_event[FACE_ENROL_BUTTON_ID].event = TOUCH_BUTTON_EVENT_RELEASED;
                    touch_button_event[FACE_ENROL_BUTTON_ID].pressed = false;
                }

