Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
                /* Check if we're in on-device enrolment */
                if (enrollment_state != ENROLLMENT_STATE_NONE && enrollment_type == ENROLLMENT_TYPE_ON_DEVICE)
                {

                    printf("[LCD_TASK] Cancelling on-device enrolment via BTN1\n");

                    /* Call the abort function to clean up */
                    ifx_result = ifx_abort_on_device_enrollment(&enrollment_config);
                    if (ifx_result != IFX_FACEID_RSLT_SUCCESS)
                    {
                        printf("[LCD_TASK][ERROR] Failed to properly abort enrolment\n");
                    }

                    /* Reset enrolment state */
                    enrollment_state = ENROLLMENT_STATE_NONE;
                    enrollment_type = ENROLLMENT_TYPE_NONE;
                    current_display_mode = DISPLAY_MODE_INFERENCE;
                }

                else if (enrollment_state == ENROLLMENT_STATE_UART_TRANSFER)
                {
                    /* Can't cancel UART transfer mid-process */
                    printf("\n[LCD_TASK] Can't interrupt off-device enrolment during UART transfer\n");
                }
            }

#ifndef DISABLE_ONDEV_ENROLL

            /* Start/stop enrolment button handler */
#ifdef ENABLE_WEB_STREAMING
            if (touch_button_event[FACE_ENROL_BUTTON_ID].pressed || touch_button_event[FACE_ENROL_BUTTON_ID].released || fid_home_start_enrollment_flag || fid_home_complete_enrollment_flag)
#else
            if (touch_button_event[FACE_ENROL_BUTTON_ID].pressed || touch_button_event[FACE_ENROL_BUTTON_ID].released || fid_home_start_enrollment_flag)
#endif
            {
#ifdef ENABLE_WEB_STREAMING
                bool was_uart_command = fid_home_start_enrollment_flag;
                bool force_complete = fid_home_complete_enrollment_flag;
                fid_home_complete_enrollment_flag = false;
#endif
                fid_home_start_enrollment_flag = false;
                /* If not enrolling, start on-device enrolment */
                if (enrollment_state == ENROLLMENT_STATE_NONE)
                {
#ifdef ENABLE_WEB_STREAMING
                    /* For UART-triggered enrollment, require streaming to be active */
                    if (was_uart_command && !chunked_stream_is_active())
                    {
                        printf("[LCD_TASK] Cannot start UART enrollment - streaming not active (send 'S' command first)\n");
                        touch_button_event[FACE_ENROL_BUTTON_ID].pressed = false;
                        /* Don't start enrollment */
                    }

                    /* CHECK DATABASE CAPACITY BEFORE STARTING ENROLLMENT */
                    else if (is_database_full())
#else
                    if (is_database_full())
#endif
                    {
                        printf("[LCD_TASK] Cannot start enrolment - database is full (%d/%d users)\n",
                                current_user_count, MAX_N_USER);
                        trigger_database_full_overlay(); /* Show 5-second overlay warning */

                        touch_button_event[FACE_ENROL_BUTTON_ID].pressed = false;

                    }
                    else
                    {
                        printf("[LCD_TASK] Starting on-device enrolment - waiting for high-quality reference face\n");
                        enrollment_state = ENROLLMENT_STATE_WAITING_FOR_REFERENCE;
                        enrollment_type = ENROLLMENT_TYPE_ON_DEVICE;
                        current_display_mode = DISPLAY_MODE_ENROLLMENT;

#ifdef ENABLE_WEB_STREAMING
                        /* Send initial enrollment progress (state=1: Waiting for Face) */
                        if (chunked_stream_is_active())
                        {
                            char user_name[20];
                            snprintf(user_name, sizeof(user_name), "User_%d", current_user_count);
                            uint8_t pose_progress[MAX_ENROLLMENT_POSES] = {0};  /* All poses at 0% */
                            chunked_stream_push_enrollment_progress(1, 0, 5, 0, pose_progress, user_name);
                            printf("[LCD_TASK] Sent initial enrollment notification via UART\n");
                        }
#endif
                        touch_button_event[FACE_ENROL_BUTTON_ID].pressed = false;

                    }
                }
                /* If already in the collecting state, complete enrolment */
#ifdef ENABLE_WEB_STREAMING
                else if ((enrollment_state == ENROLLMENT_STATE_COLLECTING &&
                        enrollment_type == ENROLLMENT_TYPE_ON_DEVICE) ||
                        (force_complete && enrollment_state == ENROLLMENT_STATE_COLLECTING))
#else
                else if (enrollment_state == ENROLLMENT_STATE_COLLECTING &&
                        enrollment_type == ENROLLMENT_TYPE_ON_DEVICE)
#endif
                {
#ifdef ENABLE_WEB_STREAMING
                    printf("[LCD_TASK] Completing on-device enrolment%s...\n", force_complete ? " (early completion)" : "");
#else
                    printf("[LCD_TASK] Completing on-device enrolment...\n");
#endif
                    enrollment_state = ENROLLMENT_STATE_COMPLETING;

                    /* Complete the enrolment process and add user to database */
                    ifx_result = ifx_complete_on_device_enrollment(&faceid_embeddings, &enrollment_config, &inference_config);
                    if (ifx_result == IFX_FACEID_RSLT_SUCCESS)
                    {
                        printf("[LCD_TASK] On-device enrolment completed successfully!\n");

                        if (CY_RRAM_SUCCESS != ifx_copy_embeddings_to_nvm((uint32_t) &enrolled_user_faceid_embeddings,
                                (uint8_t *) &faceid_embeddings,
                                sizeof(faceid_embeddings)))
                        {
                            printf("[LCD_TASK][ERROR] Failed to add enrolled user data to the NVM database\r\n");
                        }
                        else
                        {
                            printf("[LCD_TASK] Added enrolled user data to the NVM database successfully!\r\n");
                        }

                        /* Update user count after successful enrolment */
                        db_update_result = update_database_user_count();
                        if (db_update_result != IFX_FACEID_RSLT_SUCCESS)
                        {
                            printf("[LCD_TASK][WARNING] Failed to update user count after enrolment: %d\n", db_update_result);
                        }
                    }
                    else if (ifx_result == IFX_FACEID_RSLT_DB_FULL)
                    {
                        printf("[LCD_TASK][ERROR] Database is full - cannot add new user\n");
                        trigger_database_full_overlay(); /* Show overlay warning */

                        /* Call the abort function to clean up */
                        ifx_result = ifx_abort_on_device_enrollment(&enrollment_config);
                        if (ifx_result != IFX_FACEID_RSLT_SUCCESS)
                        {
                            printf("[LCD_TASK][ERROR] Failed to properly abort enrolment\n");
                        }
                    }
                    else
                    {
                        printf("[LCD_TASK][ERROR] Failed to complete on-device enrolment\n");

                        /* Call the abort function to clean up */
                        ifx_result = ifx_abort_on_device_enrollment(&enrollment_config);
                        if (ifx_result != IFX_FACEID_RSLT_SUCCESS)
                        {
                            printf("[LCD_TASK][ERROR] Failed to properly abort enrolment\n");
                        }
                    }

