Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
                    /* Reset enrolment state */
                    enrollment_state = ENROLLMENT_STATE_NONE;
                    enrollment_type = ENROLLMENT_TYPE_NONE;
                    current_display_mode = DISPLAY_MODE_INFERENCE;

                    touch_button_event[FACE_ENROL_BUTTON_ID].released = false;

                }
                /* If in waiting state, cancel enrolment */
                else if (enrollment_state == ENROLLMENT_STATE_WAITING_FOR_REFERENCE &&
                        enrollment_type == ENROLLMENT_TYPE_ON_DEVICE)
                {
                    printf("[LCD_TASK] Cancelling on-device enrolment\n");
                    enrollment_state = ENROLLMENT_STATE_NONE;
                    enrollment_type = ENROLLMENT_TYPE_NONE;
                    current_display_mode = DISPLAY_MODE_INFERENCE;

                    touch_button_event[FACE_ENROL_BUTTON_ID].released = false;

                }
                /* If in UART transfer state, do nothing (can't cancel easily) */
                else if (enrollment_state == ENROLLMENT_STATE_UART_TRANSFER)
                {
                    printf("[LCD_TASK] Can't interrupt off-device enrolment during UART transfer\n");

                    touch_button_event[FACE_ENROL_BUTTON_ID].released = false;

                }
            }
#endif /* DISABLE_ONDEV_ENROLL */

            time_model_end = ifx_time_get_ms_f();

#ifdef SHOW_INFERENCING_TIME
            model_inferencing_time = (time_model_end - time_model_start);
#else
            fps = 1000.0f / (time_model_end - time_model_start);
#endif /* SHOW_INFERENCING_TIME */

#ifdef ENABLE_WEB_STREAMING
            /* Skip LCD rendering when UART streaming to maximize FPS
            * LCD rendering + V-sync takes 50-100ms, limiting to 10-20 FPS
            * Face ID results still computed and available over UART */
            if (!is_uart_streaming)
            {
#endif
                /* Use different display update based on mode */
                update_lcd_display(&prediction, current_display_mode, current_enrollment_feedback, &enrollment_config);



                /* Check for start face enrolment button state */
                switch (touch_button_event[FACE_ENROL_BUTTON_ID].event)
                {
                case TOUCH_BUTTON_EVENT_RELEASED: /* Start face enrolment button in released state */
                    /* Display start face enrolment button */
                    ifx_lcd_display_Rect(FACE_ENROL_BTN_X_POS, FACE_ENROL_BTN_Y_POS, (uint8_t *) start_face_enrolment_btn_img_map, START_FACE_ENROLMENT_BUTTON_WIDTH, START_FACE_ENROLMENT_BUTTON_HEIGHT);
                    break;

                case TOUCH_BUTTON_EVENT_PRESSED: /* Save face enrolment button in pressed state */
                    /* Display save face enrolment button */
                    ifx_lcd_display_Rect(FACE_ENROL_BTN_X_POS, FACE_ENROL_BTN_Y_POS, (uint8_t *) save_face_enrolment_btn_img_map, SAVE_FACE_ENROLMENT_BUTTON_WIDTH, SAVE_FACE_ENROLMENT_BUTTON_HEIGHT);
                    break;
                }

                /* Check if clear enrolled users button is pressed */
                if (TOUCH_BUTTON_EVENT_PRESSED == touch_button_event[CLEAR_ENROL_BUTTON_ID].event)
                {
                    /* Display clear enrolled users button in pressed state */
                    touch_button_event[CLEAR_ENROL_BUTTON_ID].event = TOUCH_BUTTON_EVENT_RELEASED;
                    ifx_lcd_display_Rect(CLEAR_BTN_X_POS, CLEAR_BTN_Y_POS, (uint8_t *) clear_pressed_btn_img_map, CLEAR_PRESSED_BUTTON_WIDTH, CLEAR_PRESSED_BUTTON_HEIGHT);
                }
                else
                {
                    /* Display clear enrolled users button in released state */
                    ifx_lcd_display_Rect(CLEAR_BTN_X_POS, CLEAR_BTN_Y_POS, (uint8_t *) clear_released_btn_img_map, CLEAR_RELEASED_BUTTON_WIDTH, CLEAR_RELEASED_BUTTON_HEIGHT);
                }

                /* Check if cancel face enrolment button is pressed */
                if (TOUCH_BUTTON_EVENT_PRESSED == touch_button_event[CANCEL_ENROL_BUTTON_ID].event)
                {
                    /* Display cancel face enrolment button in pressed state */
                    touch_button_event[CANCEL_ENROL_BUTTON_ID].event = TOUCH_BUTTON_EVENT_RELEASED;
                    ifx_lcd_display_Rect(CANCEL_BTN_X_POS, CANCEL_BTN_Y_POS, (uint8_t *) cancel_pressed_btn_img_map, CANCEL_PRESSED_BUTTON_WIDTH, CANCEL_PRESSED_BUTTON_HEIGHT);
                }
                else
                {
                    /* Display cancel face enrolment button in released state */
                    ifx_lcd_display_Rect(CANCEL_BTN_X_POS, CANCEL_BTN_Y_POS, (uint8_t *) cancel_released_btn_img_map, CANCEL_RELEASED_BUTTON_WIDTH, CANCEL_RELEASED_BUTTON_HEIGHT);
                }


                /* switch frames to latest */
                VG_switch_frame();
#ifdef ENABLE_WEB_STREAMING
            }
            /* Send complete Face ID metadata AFTER inference (separate from image)
            * Image frame was already queued right after getInputImage()
            * Send metadata ALWAYS to report detection status (even 0 faces) */
            if (is_uart_streaming && ifx_result == IFX_FACEID_RSLT_SUCCESS)
            {
                /* Build Face ID metadata array (max 4 faces) */
                #define MAX_META_FACES 4
                faceid_face_info_t faces[MAX_META_FACES];
                uint8_t num_faces = (prediction.count > MAX_META_FACES) ? MAX_META_FACES : prediction.count;

                /* Count known vs unknown faces */
                int known_faces = 0;
                for (int i = 0; i < num_faces; i++)
                {
                    if (prediction.id[i] >= 0)
                    {
                        known_faces++;
                    }
                }

                /* Extract details for each detected face */
                for (int i = 0; i < num_faces; i++)
                {
                    /* Extract bounding box (bbox format: [x1, y1, x2, y2]) */
                    int16_t *bbox = &prediction.bbox_int16[i << 2];
                    faces[i].bbox_x1 = bbox[0];
                    faces[i].bbox_y1 = bbox[1];
                    faces[i].bbox_x2 = bbox[2];
                    faces[i].bbox_y2 = bbox[3];

                    /* Extract user ID (-1 = unknown, >=0 = recognized) */
                    faces[i].user_id = prediction.id[i];

                    /* Extract confidence (convert float 0-1 to uint16 x 1000) */
                    /* Use similarity for recognized faces, conf for detection quality */
                    if (prediction.id[i] >= 0)
                    {
                        faces[i].confidence = (uint16_t)(prediction.similarity[i] * 1000.0f);
                    } else {
                        faces[i].confidence = (uint16_t)(prediction.conf[i] * 1000.0f);
                    }

                    /* Copy user name (15 chars max, null-terminated) */
                    if (prediction.id[i] >= 0)
                    {
                        strncpy(faces[i].user_name, prediction.class_string[i], 15);
                        faces[i].user_name[15] = '\0';
                    } else {
                        strcpy(faces[i].user_name, "Unknown");
                    }
                }

