Infineon/mtb-example-psoc-edge-ml-face-id/proj_cm55/lcd_task.c
                /* Send complete Face ID response via chunked protocol
                * Includes: total faces, known faces, all bounding boxes, user IDs, names, confidence */
                bool metadata_sent = chunked_stream_push_faceid(num_faces, faces);

                /* Debug: Log Face ID results and transmission status */
                static uint32_t frame_count = 0;
                frame_count++;

                if (num_faces > 0)
                {
                    static uint32_t frame_with_faces = 0;
                    frame_with_faces++;
                    if ((frame_with_faces % 30) == 1) {  /* Log every 30 frames with faces */
                        printf("[Face ID] Frame %" PRIu32 ": %d faces (%d known, %d unknown) - Metadata %s\r\n",
                            frame_with_faces, num_faces, known_faces, num_faces - known_faces,
                            metadata_sent ? "SENT" : "FAILED");
                    }
                }
                else
                {
                    /* Log no-face detection periodically */
                    if ((frame_count % 100) == 1)
                    {
                        printf("[Face ID] Frame %" PRIu32 ": No faces detected - Metadata %s\r\n",
                            frame_count, metadata_sent ? "SENT" : "FAILED");
                    }
                }
            }

#endif
            __DMB();
        }

        else
        {
            for (uint8_t i = 0; i < NUM_IMAGE_BUFFERS; i++)
            {
                vg_lite_clear(renderTarget, NULL, BLACK_COLOR);
                vg_lite_finish();


                if (camera_not_supported)
                {
                    /* Display camera not supported image */
                    ifx_lcd_display_Rect(CAMERA_NOT_SUPPORTED_IMG_X_POS , CAMERA_NOT_SUPPORTED_IMG_Y_POS,  (uint8_t *) camera_not_supported_img_map, CAMERA_NOT_SUPPORTED_IMG_WIDTH, CAMERA_NOT_SUPPORTED_IMG_HEIGHT);
                }
                else
                {
                    /* Display no camera image */
                    ifx_lcd_display_Rect(NO_CAMERA_IMG_X_POS , NO_CAMERA_IMG_Y_POS,  (uint8_t *) no_camera_img_map, NO_CAMERA_IMG_WIDTH, NO_CAMERA_IMG_HEIGHT);
                }

                VG_switch_frame();
                __DMB();

                /* Delay between publishing frame buffers to the display */
                vTaskDelay(pdMS_TO_TICKS(30));
            }
        }

    }
}

/* [] END OF FILE */
